[
  {
    "name": "Aarakocra",
    "cr": "1/4",
    "type": "Humanoid (aarakocra)",
    "alignment": "Neutral Good",
    "biomes": ["Mountain"],
    "immunities": [],
    "traits": [
      "Dive Attack: If the aarakocra is flying and dives at least 30 feet straight toward a target and then hits it with a melee weapon attack, the attack deals an extra 3 (1d6) damage to the target."
    ],
    "actions": [
      "Talon: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) slashing damage.",
      "Javelin: Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Abjurer Wizard",
    "cr": "9",
    "type": "Humanoid",
    "alignment": "Any alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Arcane Ward: The wizard has a magical ward that has 30 hit points. Whenever the wizard takes damage, the ward takes the damage instead. If the ward is reduced to 0 hit points, the wizard takes any remaining damage.",
      "Magic Resistance: The wizard has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The wizard makes three Arcane Burst attacks.",
      "Arcane Burst: Melee or Ranged Spell Attack: +9 to hit, reach 5 ft. or range 120 ft., one target. Hit: 20 (3d10 + 4) force damage.",
      "Spellcasting: Casts spells like Mage Armor, Dispel Magic, and Globe of Invulnerability."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Aboleth",
    "cr": "10",
    "type": "Aberration",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark", "Underwater"],
    "immunities": [],
    "traits": [
      "Amphibious: The aboleth can breathe air and water.",
      "Mucous Cloud: While underwater, the aboleth is surrounded by transformative mucus. A creature that touches the aboleth or hits it with a melee attack while within 5 feet of it must make a DC 14 Constitution saving throw or be unable to breathe air for 1 hour.",
      "Probing Telepathy: If a creature communicates telepathically with the aboleth, the aboleth learns the creature's greatest desires if the aboleth can see the creature."
    ],
    "actions": [
      "Multiattack: The aboleth makes three tentacle attacks.",
      "Tentacle: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage plus disease (DC 14 Con save).",
      "Tail: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 15 (3d6 + 5) bludgeoning damage.",
      "Enslave (3/Day): The aboleth targets one creature it can see within 30 feet of it. The target must succeed on a DC 14 Wisdom saving throw or be magically charmed."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Adult Kruthik",
    "cr": "2",
    "type": "Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Desert", "Mountain", "Underdark"],
    "immunities": [],
    "traits": [
      "Keen Smell: The kruthik has advantage on Wisdom (Perception) checks that rely on smell.",
      "Pack Tactics: The kruthik has advantage on an attack roll against a creature if at least one of the kruthik's allies is within 5 feet of the creature and the ally isn't incapacitated.",
      "Tunneler: The kruthik can burrow through solid rock at half its burrow speed and leaves a 5-foot-diameter tunnel in its wake."
    ],
    "actions": [
      "Multiattack: The kruthik makes two stab attacks.",
      "Stab: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage.",
      "Spike: Ranged Weapon Attack: +5 to hit, range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Androsphinx",
    "cr": "17",
    "type": "Monstrosity",
    "alignment": "Lawful Neutral",
    "biomes": ["Desert"],
    "immunities": ["Psychic damage", "Bludgeoning, piercing, and slashing from nonmagical attacks"],
    "traits": [
      "Inscrutable: The sphinx is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses.",
      "Magic Weapons: The sphinx's weapon attacks are magical.",
      "Spellcasting: The sphinx is a 12th-level spellcaster (DC 18, +10 to hit) with spells like Greater Restoration and Flame Strike."
    ],
    "actions": [
      "Multiattack: The sphinx makes two claw attacks.",
      "Claw: Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) slashing damage.",
      "Roar (3/Day): The sphinx emits a magical roar. Each creature within 500 feet that can hear it must succeed on a DC 18 Wisdom saving throw or suffer effects ranging from being frightened to being paralyzed and taking thunder damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ankheg",
    "cr": "2",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Forest", "Grassland"],
    "immunities": [],
    "traits": [
      "Tunneler: The ankheg can burrow through solid rock at half its burrow speed and leaves a 5-foot-diameter tunnel in its wake."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage plus 3 (1d6) acid damage. If the target is a Large or smaller creature, it is grappled (escape DC 13).",
      "Acid Spray (Recharge 6): The ankheg spits acid in a line that is 30 feet long and 5 feet wide. Each creature in that line must make a DC 13 Dexterity saving throw, taking 10 (3d6) acid damage on a failed save, or half as much damage on a successful one."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Apprentice Wizard",
    "cr": "1/4",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Spellcasting: The apprentice is a 1st-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 12, +4 to hit with spell attacks). It has the following wizard spells prepared: Cantrips (at will): fire bolt, mending, prestige; 1st level (2 slots): burning hands, disguise self, shield."
    ],
    "actions": [
      "Arcane Burst: Melee or Ranged Spell Attack: +4 to hit, reach 5 ft. or range 120 ft., one target. Hit: 7 (1d10 + 2) force damage.",
      "Dagger: Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 4 (1d4 + 2) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Archdruid",
    "cr": "12",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Forest", "Mountain"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The archdruid has advantage on saving throws against spells and other magical effects.",
      "Spellcasting: The archdruid is an 18th-level spellcaster (DC 17, +9 to hit). It has the following druid spells prepared: Cantrips (at will): druidcraft, mending, poison spray, produce flame; 1st-9th level: animal shapes, foresight, fire storm, heroes' feast, etc."
    ],
    "actions": [
      "Multiattack: The archdruid makes three attacks with its quarterstaff or Wildfire (if available).",
      "Staff: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) bludgeoning damage, or 6 (1d8 + 2) bludgeoning damage if used with two hands.",
      "Wildfire: Ranged Spell Attack: +9 to hit, range 120 ft., one target. Hit: 21 (6d6) fire damage.",
      "Change Shape (2/Day): The archdruid magically transforms into a Beast or Elemental with a CR of 6 or less."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Archer",
    "cr": "3",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban", "Forest", "Mountain"],
    "immunities": [],
    "traits": [
      "Archer's Eye (3/Day): As a bonus action, the archer can add 1d10 to its next attack or damage roll with a longbow or shortbow."
    ],
    "actions": [
      "Multiattack: The archer makes two attacks with its longbow.",
      "Shortsword: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) piercing damage.",
      "Longbow: Ranged Weapon Attack: +6 to hit, range 150/600 ft., one target. Hit: 8 (1d8 + 4) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Banderhobb",
    "cr": "5",
    "type": "Large Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Urban", "Forest", "Swamp"],
    "immunities": [],
    "traits": [
      "Resonant Connection: If the banderhobb has a piece of a creature (hair, nail, etc.), it knows the distance and direction to that creature so long as they are on the same plane.",
      "Shadow Stealth: While in dim light or darkness, the banderhobb can take the Hide action as a bonus action."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 22 (5d6 + 5) piercing damage, and the target is grappled (escape DC 15) and swallowed if the banderhobb doesn't have another creature swallowed.",
      "Tongue: Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 10 (3d6) necrotic damage. If the target is a creature, it must succeed on a DC 15 Strength saving throw or be pulled to a space within 5 feet of the banderhobb.",
      "Shadow Jaunt: The banderhobb magically teleports up to 30 feet to an unoccupied space it can see that is in dim light or darkness."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Banshee",
    "cr": "4",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban", "Forest"],
    "immunities": ["Cold damage", "Necrotic damage", "Poison damage", "Condition: Charmed, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Detect Life: The banshee can magically sense the presence of creatures up to 5 miles away that aren't undead or constructs.",
      "Incorporeal Movement: The banshee can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    ],
    "actions": [
      "Corrupting Touch: Melee Spell Attack: +4 to hit, reach 5 ft., one target. Hit: 12 (3d6 + 2) necrotic damage.",
      "Horrifying Visage: Each non-undead creature within 60 feet of the banshee that can see her must succeed on a DC 13 Wisdom saving throw or be frightened for 1 minute.",
      "Wail (1/Day): The banshee releases a mournful wail. This wail has no effect on undead and constructs. All other creatures within 30 feet of her that can hear her must make a DC 13 Constitution saving throw. On a failure, a creature drops to 0 hit points. On a success, a creature takes 10 (3d6) psychic damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Bard",
    "cr": "2",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Spellcasting: The bard is a 4th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). Cantrips (at will): friends, mage hand, vicious mockery; 1st level (4 slots): charm person, healing word, heroism, sleep; 2nd level (3 slots): invisibility, shatter.",
      "Taunt (2/Day): The bard can use a bonus action to target one creature within 30 feet. If the target can hear the bard, it must succeed on a DC 12 Charisma saving throw or have disadvantage on ability checks, attack rolls, and saving throws until the start of the bard's next turn."
    ],
    "actions": [
      "Shortsword: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Shortbow: Ranged Weapon Attack: +4 to hit, range 80/320 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Basilisk",
    "cr": "3",
    "type": "Medium Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Desert", "Underdark", "Mountain"],
    "immunities": [],
    "traits": [
      "Petrifying Gaze: If a creature starts its turn within 30 feet of the basilisk and the two can see each other, the basilisk can force the creature to make a DC 12 Constitution saving throw. On a failure, the creature magically begins to turn to stone and is restrained. It must repeat the saving throw at the end of its next turn. On a success, the effect ends. On a failure, the creature is petrified."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) piercing damage plus 7 (2d6) poison damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Beholder",
    "cr": "13",
    "type": "Large Aberration",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Antimagic Cone: The beholder's central eye creates an area of antimagic, as in the antimagic field spell, in a 150-foot cone. At the start of each of its turns, the beholder decides which way the cone faces and whether it is active."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 14 (4d6) piercing damage.",
      "Eye Rays: The beholder shoots three of the following magical eye rays at random (reroll duplicates), choosing one to three targets it can see within 120 feet: 1. Charm Ray, 2. Paralyzing Ray, 3. Fear Ray, 4. Slowing Ray, 5. Enervation Ray, 6. Telekinetic Ray, 7. Sleep Ray, 8. Petrification Ray, 9. Disintegration Ray, 10. Death Ray."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Blackguard",
    "cr": "8",
    "type": "Medium Humanoid",
    "alignment": "Any Evil Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Dreadful Aspect (Recharges after a Short or Long Rest): The blackguard exudes magical menace. Each enemy within 30 feet of the blackguard must succeed on a DC 13 Wisdom saving throw or be frightened of the blackguard for 1 minute."
    ],
    "actions": [
      "Multiattack: The blackguard makes three melee attacks.",
      "Glaive: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 9 (1d10 + 4) slashing damage plus 9 (2d8) necrotic damage.",
      "Shortbow: Ranged Weapon Attack: +5 to hit, range 80/320 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Beholder Zombie",
    "cr": "5",
    "type": "Large Undead",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Undead Fortitude: If damage reduces the zombie to 0 hit points, it must make a Con save (DC 5 + damage taken), unless the damage is radiant or from a critical hit. On success, it drops to 1 hit point instead."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 14 (4d6) piercing damage.",
      "Eye Ray: The zombie shoots one of the following rays at random at a target it can see within 60 feet: 1. Paralyzing Ray, 2. Fear Ray, 3. Enervation Ray, 4. Disintegration Ray."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Berbalang",
    "cr": "2",
    "type": "Medium Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Astral Plane", "Urban"],
    "immunities": [],
    "traits": [
      "Spectral Duplicate (Recharges after a Short or Long Rest): As a bonus action, the berbalang creates a spectral duplicate of itself in an unoccupied space within 60 feet. It can see through its eyes and cast spells through it.",
      "Innate Spellcasting: Can cast Speak with Dead at will."
    ],
    "actions": [
      "Multiattack: The berbalang makes two attacks: one with its bite and one with its claws.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (1d10 + 2) piercing damage.",
      "Claw: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Black Abishai",
    "cr": "7",
    "type": "Medium Fiend (Devil)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Fire damage", "Poison damage", "Condition: Poisoned"],
    "traits": [
      "Devil's Sight: Magical darkness doesn't impede the abishai's darkvision.",
      "Magic Resistance: Advantage on saving throws against spells and magical effects.",
      "Shadow Stealth: While in dim light or darkness, it can take the Hide action as a bonus action."
    ],
    "actions": [
      "Multiattack: Makes three attacks: two with its scimitar and one with its bite. It can replace one attack with a Creeping Darkness.",
      "Scimitar: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage plus 7 (2d6) acid damage.",
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 8 (1d10 + 3) piercing damage plus 7 (2d6) acid damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Blue Abishai",
    "cr": "17",
    "type": "Medium Fiend (Devil)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban", "Coastal"],
    "immunities": ["Lightning damage", "Fire damage", "Poison damage", "Condition: Poisoned"],
    "traits": [
      "Devil's Sight: Magical darkness doesn't impede its darkvision.",
      "Magic Resistance: Advantage on saving throws against spells and magical effects.",
      "Spellcasting: 13th-level spellcaster (DC 18, +10 to hit). Spells include Chain Lightning, Greater Invisibility, and Wall of Force."
    ],
    "actions": [
      "Multiattack: The abishai makes three Bite or Quarterstaff attacks.",
      "Bite: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage plus 14 (4d6) lightning damage.",
      "Quarterstaff: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage plus 14 (4d6) lightning damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Bugbear Chief",
    "cr": "3",
    "type": "Medium Humanoid (Goblinoid)",
    "alignment": "Chaotic Evil",
    "biomes": ["Forest", "Grassland", "Mountain"],
    "immunities": [],
    "traits": [
      "Brute: A melee weapon deals one extra die of its damage when the bugbear hits with it (included in attack).",
      "Surprise Attack: If the bugbear surprises a creature and hits it with an attack during the first round of combat, the target takes an extra 7 (2d6) damage."
    ],
    "actions": [
      "Multiattack: The bugbear makes two melee attacks.",
      "Morningstar: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) piercing damage.",
      "Javelin: Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 10 (2d6 + 3) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Bulette",
    "cr": "5",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Mountain", "Hill", "Grassland"],
    "immunities": [],
    "traits": [
      "Standing Leap: The bulette's long jump is up to 30 feet and its high jump is up to 15 feet, with or without a running start.",
      "Tunneler: The bulette can burrow through solid rock at half its burrowing speed and leaves a 5-foot-diameter tunnel in its wake."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 30 (4d12 + 4) piercing damage.",
      "Deadly Leap: If the bulette jumps at least 15 feet as part of its movement, it can use its action to land on its feet in a space that contains one or more other creatures. Each of those creatures must succeed on a DC 16 Strength or Dexterity saving throw or be knocked prone and take 14 (3d6 + 4) bludgeoning damage plus 14 (3d6 + 4) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Cambion",
    "cr": "5",
    "type": "Medium Fiend",
    "alignment": "Any Evil Alignment",
    "biomes": ["Urban", "Underdark"],
    "immunities": [],
    "traits": [
      "Fiendish Blessing: The cambion's AC includes its Charisma bonus.",
      "Innate Spellcasting: The cambion's spellcasting ability is Charisma (spell save DC 14). It can innately cast the following spells: At will: alter self, command, detect magic; 3/day each: plane shift (self only)."
    ],
    "actions": [
      "Multiattack: The cambion makes two melee attacks or uses its Fire Ray twice.",
      "Spear: Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 7 (1d6 + 4) piercing damage, or 8 (1d8 + 4) piercing damage if used with two hands, plus 3 (1d6) fire damage.",
      "Fire Ray: Ranged Spell Attack: +7 to hit, range 120 ft., one target. Hit: 10 (3d6) fire damage.",
      "Fiendish Charm: One humanoid the cambion can see within 30 feet must succeed on a DC 14 Wisdom saving throw or be magically charmed for 1 day."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Centaur",
    "cr": "2",
    "type": "Large Monstrosity",
    "alignment": "Neutral Good",
    "biomes": ["Forest", "Grassland"],
    "immunities": [],
    "traits": [
      "Charge: If the centaur moves at least 30 feet straight toward a target and then hits it with a pike attack on the same turn, the target takes an extra 10 (3d6) piercing damage."
    ],
    "actions": [
      "Multiattack: The centaur makes two attacks: one with its pike and one with its hooves or two with its longbow.",
      "Pike: Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 9 (1d10 + 4) piercing damage.",
      "Hooves: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage.",
      "Longbow: Ranged Weapon Attack: +4 to hit, range 150/600 ft., one target. Hit: 6 (1d8 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Chimera",
    "cr": "6",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Mountain", "Hill"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Multiattack: The chimera makes three attacks: one with its bite, one with its horns, and one with its claws. When its fire breath is available, it can use the breath in place of its bite or horns.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) piercing damage.",
      "Horns: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (1d12 + 4) bludgeoning damage.",
      "Claws: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage.",
      "Fire Breath (Recharge 5–6): The dragon head exhales fire in a 15-foot cone. Each creature in that area must make a DC 15 Dexterity saving throw, taking 31 (7d8) fire damage on a failed save, or half as much damage on a successful one."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Chuul",
    "cr": "4",
    "type": "Large Aberration",
    "alignment": "Chaotic Evil",
    "biomes": ["Coastal", "Underwater"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Amphibious: The chuul can breathe air and water.",
      "Sense Magic: The chuul senses magic within 120 feet of it at will. This trait otherwise works like the detect magic spell but isn't itself magical."
    ],
    "actions": [
      "Multiattack: The chuul makes two pincer attacks. If the chuul is grappling a creature, it can also use its tentacles once.",
      "Pincer: Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage. The target is grappled (escape DC 14) if it is a Large or smaller creature and the chuul doesn't have two other creatures grappled.",
      "Tentacles: One creature grappled by the chuul must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. Until this poison ends, the target is paralyzed. The target can repeat the saving throw at the end of each of its turns."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Cloaker",
    "cr": "8",
    "type": "Large Aberration",
    "alignment": "Chaotic Neutral",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Damage Transfer: While attached to a creature, the cloaker takes only half the damage dealt to it (rounded down), and that creature takes the other half.",
      "False Appearance: While the cloaker remains motionless without its underside exposed, it is indistinguishable from a dark leather cloak.",
      "Light Sensitivity: While in bright light, the cloaker has disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Multiattack: The cloaker makes two attacks: one with its bite and one with its tail.",
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. Hit: 10 (2d6 + 3) piercing damage, and the cloaker attaches to the target. While attached, the cloaker can't bite a different target.",
      "Tail: Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 7 (1d8 + 3) slashing damage.",
      "Moan: Each creature within 60 feet of the cloaker that can hear its moan and isn't an aberration must succeed on a DC 13 Wisdom saving throw or become frightened until the end of the cloaker's next turn.",
      "Phantasms (Recharges after a Short or Long Rest): The cloaker magically creates three illusory duplicates of itself if it is in dim light or darkness. The duplicates move with it and mimic its actions."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Cloud Giant",
    "cr": "9",
    "type": "Huge Giant",
    "alignment": "Neutral Good (50%) or Neutral Evil (50%)",
    "biomes": ["Mountain"],
    "immunities": [],
    "traits": [
      "Keen Smell: The giant has advantage on Wisdom (Perception) checks that rely on smell.",
      "Innate Spellcasting: The giant's innate spellcasting ability is Charisma (spell save DC 15). It can innately cast the following spells: At will: detect magic, fog cloud, light; 3/day each: feather fall, fly, misty step, telekinesis; 1/day each: control weather, gaseous form."
    ],
    "actions": [
      "Multiattack: The giant makes two morningstar attacks.",
      "Morningstar: Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 21 (3d8 + 8) piercing damage.",
      "Rock: Ranged Weapon Attack: +12 to hit, range 60/240 ft., one target. Hit: 30 (4d10 + 8) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Cockatrice",
    "cr": "1/2",
    "type": "Small Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Grassland"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Bite: Melee Weapon Attack: +3 to hit, reach 5 ft., one creature. Hit: 1 piercing damage, and the target must succeed on a DC 11 Constitution saving throw against being magically petrified. On a failure, the creature begins to turn to stone and is restrained. It must repeat the saving throw at the end of its next turn. On a success, the effect ends. On a failure, the creature is petrified for 24 hours."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Conjurer Wizard",
    "cr": "6",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Benign Transposition: As a bonus action, the wizard can teleport up to 30 feet to an unoccupied space it can see. Alternatively, it can choose a space within range that is occupied by a Small or Medium creature. If that creature is willing, both creatures teleport, swapping places."
    ],
    "actions": [
      "Multiattack: The wizard makes three Arcane Burst attacks.",
      "Arcane Burst: Melee or Ranged Spell Attack: +7 to hit, reach 5 ft. or range 120 ft., one target. Hit: 20 (3d10 + 4) force damage.",
      "Spellcasting: The wizard casts one of the following spells, using Intelligence as the spellcasting ability (spell save DC 15): At will: dancing lights, mage hand, prestige; 2/day each: fireball, mage armor, misty step; 1/day: cloudkill."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Couatl",
    "cr": "4",
    "type": "Medium Celestial",
    "alignment": "Lawful Good",
    "biomes": ["Forest", "Grassland", "Urban"],
    "immunities": ["Psychic damage", "Bludgeoning, piercing, and slashing from nonmagical attacks"],
    "traits": [
      "Inscrutable: The couatl is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses.",
      "Magic Weapons: The couatl's weapon attacks are magical.",
      "Shielded Mind: The couatl is immune to scrying and to any effect that would sense its emotions, read its thoughts, or detect its location."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +8 to hit, reach 5 ft., one creature. Hit: 8 (1d6 + 5) piercing damage, and the target must succeed on a DC 13 Constitution saving throw or be poisoned for 24 hours. Until this poison ends, the target is unconscious.",
      "Constrict: Melee Weapon Attack: +6 to hit, reach 5 ft., one Medium or smaller creature. Hit: 10 (2d6 + 3) bludgeoning damage, and the target is grappled (escape DC 15).",
      "Change Shape: The couatl magically transforms into a humanoid or beast that has a challenge rating equal to or less than its own."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ancient Black Dragon",
    "cr": "21",
    "type": "Gargantuan Dragon",
    "alignment": "Chaotic Evil",
    "biomes": ["Swamp"],
    "immunities": ["Acid damage"],
    "traits": [
      "Amphibious: The dragon can breathe air and water.",
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead."
    ],
    "actions": [
      "Multiattack: The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +15 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 9 (2d8) acid damage.",
      "Claw: Melee Weapon Attack: +15 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) slashing damage.",
      "Acid Breath (Recharge 5–6): The dragon exhales acid in a 90-foot line that is 10 feet wide. Each creature in that line must make a DC 22 Dexterity saving throw, taking 67 (15d8) acid damage on a failed save, or half as much damage on a successful one."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Adult Blue Dragon",
    "cr": "16",
    "type": "Huge Dragon",
    "alignment": "Lawful Evil",
    "biomes": ["Desert"],
    "immunities": ["Lightning damage"],
    "traits": [
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead."
    ],
    "actions": [
      "Multiattack: The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage plus 5 (1d10) lightning damage.",
      "Lightning Breath (Recharge 5–6): The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 19 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ancient Amethyst Dragon",
    "cr": "22",
    "type": "Gargantuan Dragon (Gem)",
    "alignment": "Neutral",
    "biomes": ["Underdark", "Mountain"],
    "immunities": ["Force damage"],
    "traits": [
      "Amphibious: The dragon can breathe air and water.",
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead.",
      "Legendary Action: Teleport, Psionic Step."
    ],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 13 (3d8) force damage.",
      "Singularity Breath (Recharge 5–6): The dragon exhales a shining bead of force at a point within 300 feet. Each creature within 20 feet of that point must make a DC 22 Strength saving throw, taking 63 (14d8) force damage and being pulled toward the center."
    ],
    "source": "Fizban's Treasury of Dragons"
  },
  {
    "name": "Ancient Gold Dragon",
    "cr": "24",
    "type": "Gargantuan Dragon",
    "alignment": "Lawful Good",
    "biomes": ["Grassland", "Mountain"],
    "immunities": ["Fire damage"],
    "traits": [
      "Amphibious: The dragon can breathe air and water.",
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead."
    ],
    "actions": [
      "Multiattack: The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.",
      "Fire Breath (Recharge 5–6): The dragon exhales fire in a 90-foot cone. Each creature in that area must make a DC 24 Dexterity saving throw, taking 71 (13d10) fire damage.",
      "Weakening Breath: The dragon exhales gas in a 90-foot cone. Each creature in that area must succeed on a DC 24 Strength saving throw or have disadvantage on Strength-based attack rolls, ability checks, and saving throws for 1 minute.",
      "Change Shape: The dragon magically transforms into a humanoid or beast that has a challenge rating no higher than its own."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Young Red Dragon",
    "cr": "10",
    "type": "Large Dragon",
    "alignment": "Chaotic Evil",
    "biomes": ["Mountain"],
    "immunities": ["Fire damage"],
    "traits": [],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 3 (1d6) fire damage.",
      "Claw: Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.",
      "Fire Breath (Recharge 5–6): The dragon exhales fire in a 30-foot cone. Each creature in that area must make a DC 17 Dexterity saving throw, taking 56 (16d6) fire damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Death Giant Reaper",
    "cr": "12",
    "type": "Huge Giant",
    "alignment": "Neutral Evil",
    "biomes": ["Shadowfell", "Underdark"],
    "immunities": ["Necrotic damage"],
    "traits": [
      "Innate Spellcasting: The giant's innate spellcasting ability is Charisma (spell save DC 15). It can innately cast: At will: detect magic, invisibility (self only).",
      "Soul Thirst: When the reaper kills a creature, it gains 20 temporary hit points."
    ],
    "actions": [
      "Multiattack: The giant makes two Greataxe attacks.",
      "Greataxe: Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 26 (3d12 + 7) slashing damage plus 13 (3d8) necrotic damage.",
      "Soul Reap (Recharge 5–6): The reaper targets one creature it can see within 60 feet. The target must make a DC 15 Constitution saving throw, taking 45 (10d8) necrotic damage on a failed save, or half on a success."
    ],
    "source": "Bigby Presents: Glory of the Giants"
  },
  {
    "name": "Deathlock",
    "cr": "4",
    "type": "Medium Undead",
    "alignment": "Neutral Evil",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Innate Spellcasting: The deathlock's innate spellcasting ability is Charisma (spell save DC 13). It knows: At will: detect magic, disguise self, mage armor.",
      "Turn Resistance: The deathlock has advantage on saving throws against any effect that turns undead."
    ],
    "actions": [
      "Deathly Claw: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) necrotic damage.",
      "Grave Bolt: Ranged Spell Attack: +5 to hit, range 120 ft., one target. Hit: 14 (4d4 + 4) force damage.",
      "Spellcasting: Casts spells such as Arms of Hadar, Spider Climb, and Hunger of Hadar."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Diviner Wizard",
    "cr": "8",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Portent (3/Day): When the wizard or a creature the wizard can see makes an attack roll, a saving throw, or an ability check, the wizard can roll a d20 and choose to use that roll in place of the original.",
      "Magic Resistance: Advantage on saving throws against spells and magical effects."
    ],
    "actions": [
      "Multiattack: The wizard makes three Arcane Burst attacks.",
      "Arcane Burst: Melee or Ranged Spell Attack: +8 to hit, reach 5 ft. or range 120 ft., one target. Hit: 20 (3d10 + 4) force damage.",
      "Spellcasting: Casts spells like Detect Thoughts, Fly, and True Seeing."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Draconian Mastermind",
    "cr": "6",
    "type": "Medium Monstrosity",
    "alignment": "Lawful Evil",
    "biomes": ["Urban", "Mountain"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Death Throes (Acid Spray): When the draconian dies, its body dissolves into a pool of acid. Each creature within 5 feet must make a DC 14 Dexterity saving throw, taking 18 (4d8) acid damage on a failure.",
      "Glide: When the draconian falls and isn't incapacitated, it can subtract up to 100 feet from the fall and move 2 feet horizontally for every 1 foot it falls."
    ],
    "actions": [
      "Multiattack: The draconian makes three attacks: one with its bite and two with its shortsword, or three with its Energy Ray.",
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage.",
      "Shortsword: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage.",
      "Energy Ray: Ranged Spell Attack: +6 to hit, range 60 ft., one target. Hit: 10 (3d6) acid damage."
    ],
    "source": "Fizban's Treasury of Dragons"
  },
  {
    "name": "Drider",
    "cr": "6",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Fey Ancestry: The drider has advantage on saving throws against being charmed, and magic can't put the drider to sleep.",
      "Spider Climb: The drider can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
      "Sunlight Sensitivity: Disadvantage on attack rolls and Perception checks in direct sunlight."
    ],
    "actions": [
      "Multiattack: The drider makes three attacks, either with its longsword or its longbow. It can replace one attack with a bite.",
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 2 (1d4) piercing damage plus 9 (2d8) poison damage.",
      "Longsword: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) slashing damage, or 8 (1d10 + 3) slashing damage if used with two hands.",
      "Longbow: Ranged Weapon Attack: +6 to hit, range 150/600 ft., one target. Hit: 7 (1d8 + 3) piercing damage plus 4 (1d8) poison damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Duergar",
    "cr": "1",
    "type": "Medium Humanoid (Dwarf)",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Duergar Resilience: The duergar has advantage on saving throws against poison, spells, and the charmed or paralyzed conditions.",
      "Sunlight Sensitivity: While in sunlight, the duergar has disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Enlarge (Recharges after a Short or Long Rest): For 1 minute, the duergar magically increases in size, along with anything it is wearing or carrying. While enlarged, the duergar is Large, doubles its damage dice on Strength-based weapon attacks (included in the attacks), and makes Strength checks and Strength saving throws with advantage.",
      "War Pick: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) piercing damage, or 11 (2d8 + 2) piercing damage while enlarged.",
      "Invisibility (Recharges after a Short or Long Rest): The duergar magically turns invisible until it attacks, casts a spell, or uses its Enlarge, or until its concentration is broken."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Duergar Warlord",
    "cr": "6",
    "type": "Medium Humanoid (Dwarf)",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Duergar Resilience: Advantage on saving throws against poison, spells, and being charmed or paralyzed.",
      "Sunlight Sensitivity: Disadvantage on attack rolls and Perception checks in sunlight."
    ],
    "actions": [
      "Multiattack: The duergar makes three hammer attacks.",
      "Psychic-Attuned Hammer: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 9 (1d10 + 4) bludgeoning damage plus 5 (1d10) psychic damage. If the target is a creature, it must succeed on a DC 15 Strength saving throw or be knocked prone.",
      "Call to Attack (Recharge 5-6): Up to three allied duergar within 120 feet of the warlord that can hear it can each use their reaction to make one weapon attack."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Dybbuk",
    "cr": "4",
    "type": "Medium Fiend (Demon)",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban", "Abyss"],
    "immunities": ["Poison damage", "Condition: Poisoned, Charmed, Frightened"],
    "traits": [
      "Incorporeal Movement: The dybbuk can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.",
      "Magic Resistance: The dybbuk has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Tentacle: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) necrotic damage.",
      "Possess Corpse (Recharge 6): The dybbuk disappears into the corpse of a humanoid or a beast within 5 feet. The corpse magically rises as a zombie version of the creature. While possessing the corpse, the dybbuk has the creature's AC, HP, and physical stats, but retains its own Intelligence, Wisdom, and Charisma."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Efreeti",
    "cr": "11",
    "type": "Large Elemental",
    "alignment": "Lawful Evil",
    "biomes": ["Mountain", "Desert"],
    "immunities": ["Fire damage"],
    "traits": [
      "Elemental Demise: If the efreeti dies, its body disintegrates into a flash of fire and a puff of smoke, leaving behind only equipment it was wearing or carrying.",
      "Innate Spellcasting: The efreeti's innate spellcasting ability is Charisma (spell save DC 15, +7 to hit). It can innately cast: At will: detect magic; 3/day each: enlarge/reduce, tongues; 1/day each: conjure elemental (fire elemental only), gaseous form, invisibility, major image, plane shift, wall of fire."
    ],
    "actions": [
      "Multiattack: The efreeti makes two scimitar attacks or uses its Hurl Flame twice.",
      "Scimitar: Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage plus 7 (2d6) fire damage.",
      "Hurl Flame: Ranged Spell Attack: +7 to hit, range 120 ft., one target. Hit: 17 (5d6) fire damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Enchanter Wizard",
    "cr": "5",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Instinctive Charm: When a creature the wizard can see within 30 feet makes an attack roll against it, the wizard can use its reaction to divert the attack, provided another creature is within the attack's range. The attacker must make a DC 14 Wisdom save; on a failure, the attacker must target the creature that is closest to it (other than the wizard)."
    ],
    "actions": [
      "Multiattack: The wizard makes three Arcane Burst attacks. It can replace one attack with a use of Spellcasting.",
      "Arcane Burst: Melee or Ranged Spell Attack: +6 to hit, reach 5 ft. or range 120 ft., one target. Hit: 19 (3d10 + 3) force damage.",
      "Spellcasting: Casts spells like Charm Person, Hold Person, and Suggestion (DC 14)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Ettin",
    "cr": "4",
    "type": "Large Giant",
    "alignment": "Chaotic Evil",
    "biomes": ["Hill", "Mountain", "Underdark"],
    "immunities": [],
    "traits": [
      "Two Heads: The ettin has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, and knocked unconscious.",
      "Wakeful: When one of the ettin's heads sleeps, the other head is awake."
    ],
    "actions": [
      "Multiattack: The ettin makes two attacks: one with its battleaxe and one with its morningstar.",
      "Battleaxe: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) slashing damage.",
      "Morningstar: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Evoker Wizard",
    "cr": "9",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Sculpt Spells: When the wizard casts an evocation spell that forces other creatures it can see to make a saving throw, it can choose a number of them equal to 1 + the spell’s level. These creatures automatically succeed on their saving throws and take no damage if they would normally take half damage."
    ],
    "actions": [
      "Multiattack: The wizard makes three Arcane Burst attacks.",
      "Arcane Burst: Melee or Ranged Spell Attack: +9 to hit, reach 5 ft. or range 120 ft., one target. Hit: 20 (3d10 + 4) force damage.",
      "Spellcasting: Casts spells like Fireball, Ice Storm, and Chain Lightning (DC 17)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Fire Giant",
    "cr": "9",
    "type": "Huge Giant",
    "alignment": "Lawful Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Fire damage"],
    "traits": [],
    "actions": [
      "Multiattack: The giant makes two greatsword attacks.",
      "Greatsword: Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 28 (6d6 + 7) slashing damage.",
      "Rock: Ranged Weapon Attack: +11 to hit, range 60/240 ft., one target. Hit: 29 (4d10 + 7) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Flind",
    "cr": "9",
    "type": "Medium Humanoid (Gnoll)",
    "alignment": "Chaotic Evil",
    "biomes": ["Grassland", "Desert"],
    "immunities": [],
    "traits": [
      "Aura of Blood Thirst: If the flind isn't incapacitated, any creature with the Rampage trait can make its bite attack as a bonus action while within 10 feet of the flind."
    ],
    "actions": [
      "Multiattack: The flind makes three attacks: one with its flail of madness, one with its flail of pain, and one with its flail of paralysis.",
      "Flail of Madness: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 10 (1d10 + 5) bludgeoning damage plus 10 (3d6) psychic damage, and the target must succeed on a DC 16 Wisdom save or be forced to attack a random creature on its next turn.",
      "Flail of Pain: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 10 (1d10 + 5) bludgeoning damage plus 22 (4d10) necrotic damage.",
      "Flail of Paralysis: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 10 (1d10 + 5) bludgeoning damage, and the target must succeed on a DC 16 Constitution save or be paralyzed until the end of its next turn."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Frost Giant",
    "cr": "8",
    "type": "Huge Giant",
    "alignment": "Neutral Evil",
    "biomes": ["Arctic", "Mountain"],
    "immunities": ["Cold damage"],
    "traits": [],
    "actions": [
      "Multiattack: The giant makes two greataxe attacks.",
      "Greataxe: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 25 (3d12 + 6) slashing damage.",
      "Rock: Ranged Weapon Attack: +9 to hit, range 60/240 ft., one target. Hit: 28 (4d10 + 6) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Gauth",
    "cr": "6",
    "type": "Medium Aberration",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Stunning Gaze: When a creature that can see the gauth's central eye starts its turn within 30 feet of the gauth, the gauth can force it to make a DC 14 Wisdom saving throw. On a failure, the creature is stunned until the start of its next turn.",
      "Death Throes: When the gauth dies, the magical energy within it explodes. Each creature within 10 feet of it must make a DC 14 Dexterity saving throw, taking 13 (3d8) force damage on a failed save."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 9 (2d5 + 3) piercing damage.",
      "Eye Rays: The gauth shoots three of the following magical eye rays at random (reroll duplicates) at targets it can see within 120 feet: 1. Devour Magic Ray, 2. Enervation Ray, 3. Fire Ray, 4. Paralyzing Ray, 5. Pushing Ray, 6. Sleep Ray."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Ghost",
    "cr": "4",
    "type": "Medium Undead",
    "alignment": "Any Alignment",
    "biomes": ["Urban", "Underdark", "Forest"],
    "immunities": ["Cold damage", "Necrotic damage", "Poison damage", "Condition: Charmed, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Ethereal Sight: The ghost can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa.",
      "Incorporeal Movement: The ghost can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    ],
    "actions": [
      "Withering Touch: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 17 (4d6 + 3) necrotic damage.",
      "Etherealness: The ghost enters the Ethereal Plane from the Material Plane, or vice versa.",
      "Horrifying Visage: Each non-undead creature within 60 feet of the ghost that can see it must succeed on a DC 13 Wisdom saving throw or be frightened for 1 minute. If the save fails by 5 or more, the target also ages 1d4 × 10 years.",
      "Possession (Recharge 6): The ghost targets one humanoid it can see within 5 feet. The target must succeed on a DC 13 Charisma saving throw or be possessed by the ghost."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Giff",
    "cr": "3",
    "type": "Medium Humanoid",
    "alignment": "Lawful Neutral",
    "biomes": ["Urban", "Astral Plane"],
    "immunities": [],
    "traits": [
      "Firearms Knowledge: The giff’s proficiency bonus is doubled for attack rolls it makes with firearms.",
      "Headbutt: If the giff moves at least 20 feet straight toward a target and then hits it with a headbutt attack on the same turn, the target takes an extra 7 (2d6) bludgeoning damage."
    ],
    "actions": [
      "Multiattack: The giff makes two longsword attacks or two musket attacks.",
      "Longsword: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage.",
      "Musket: Ranged Weapon Attack: +4 to hit, range 40/120 ft., one target. Hit: 7 (1d12 + 1) piercing damage.",
      "Frag Grenade (1/Day): The giff throws a grenade up to 60 feet. Each creature within 20 feet must make a DC 15 Dexterity saving throw, taking 17 (5d6) piercing damage on a failure."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Githyanki Gish",
    "cr": "10",
    "type": "Medium Humanoid (Gith)",
    "alignment": "Lawful Evil",
    "biomes": ["Astral Plane", "Urban"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting (Psionics): The githyanki’s innate spellcasting ability is Intelligence (spell save DC 15). It can innately cast: At will: mage hand (invisible); 3/day each: jump, misty step, nondetection (self only).",
      "War Magic: When the githyanki uses its action to cast a spell, it can make one weapon attack as a bonus action."
    ],
    "actions": [
      "Multiattack: The githyanki makes three Greatsword attacks.",
      "Greatsword: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage plus 18 (4d8) psychic damage.",
      "Spellcasting: The githyanki is an 8th-level spellcaster. It has the following wizard spells prepared: 1st level: shield, thunderwave; 2nd level: invisibility, mirror image; 3rd level: counterspell, fireball, haste; 4th level: dimension door."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Glabrezu",
    "cr": "9",
    "type": "Large Fiend (Demon)",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark", "Abyss"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Magic Resistance: The glabrezu has advantage on saving throws against spells and other magical effects.",
      "Innate Spellcasting: Ability is Intelligence (save DC 16). At will: darkness, detect magic, dispel magic; 1/day each: confusion, fly, power word stun."
    ],
    "actions": [
      "Multiattack: The glabrezu makes four attacks: two with its pincers and two with its fists. Alternatively, it makes two pincer attacks and casts one spell.",
      "Pincer: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 16 (2d10 + 5) bludgeoning damage. If the target is Medium or smaller, it is grappled (escape DC 15).",
      "Fist: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 10 (2d4 + 5) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Gnoll Flesh Gnawer",
    "cr": "1",
    "type": "Medium Humanoid (Gnoll)",
    "alignment": "Chaotic Evil",
    "biomes": ["Grassland", "Forest"],
    "immunities": [],
    "traits": [
      "Rampage: When the gnoll reduces a creature to 0 hit points with a melee attack on its turn, the gnoll can take a bonus action to move up to half its speed and make a bite attack.",
      "Sudden Rush: Until the end of its turn, the gnoll’s speed increases by 20 feet and it doesn't provoke opportunity attacks."
    ],
    "actions": [
      "Multiattack: The gnoll makes three attacks: one with its bite and two with its shortsword.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage.",
      "Shortsword: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Goblin",
    "cr": "1/4",
    "type": "Small Humanoid (Goblinoid)",
    "alignment": "Neutral Evil",
    "biomes": ["Forest", "Grassland", "Underdark"],
    "immunities": [],
    "traits": [
      "Nimble Escape: The goblin can take the Disengage or Hide action as a bonus action on each of its turns."
    ],
    "actions": [
      "Scimitar: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage.",
      "Shortbow: Ranged Weapon Attack: +4 to hit, range 80/320 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Gorgon",
    "cr": "5",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Grassland", "Hill"],
    "immunities": [],
    "traits": [
      "Trampling Charge: If the gorgon moves at least 20 feet straight toward a creature and then hits it with a gore attack on the same turn, that target must succeed on a DC 16 Strength saving throw or be knocked prone. If the target is prone, the gorgon can make one attack with its hooves against it as a bonus action."
    ],
    "actions": [
      "Gore: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 18 (2d12 + 5) piercing damage.",
      "Hooves: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 16 (2d10 + 5) bludgeoning damage.",
      "Petrifying Breath (Recharge 5–6): The gorgon exhales petrifying gas in a 30-foot cone. Each creature in that area must succeed on a DC 13 Constitution saving throw or magically begin to turn to stone and be restrained. The target must repeat the saving throw at the end of its next turn. On a success, the effect ends. On a failure, the creature is petrified until freed by the greater restoration spell or other magic."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Gray Render",
    "cr": "12",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Forest", "Hill", "Mountain"],
    "immunities": [],
    "traits": [
      "Bloody Rampage: When the gray render takes damage, it makes one claw attack against a random creature within its reach (other than its master).",
      "Indestructible Bond: The gray render can't be charmed, and it is always aware of its master’s direction and distance as long as they are on the same plane of existence."
    ],
    "actions": [
      "Multiattack: The gray render makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 21 (3d10 + 5) piercing damage. If the target is Large or smaller, it is grappled (escape DC 15).",
      "Claw: Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 14 (2d8 + 5) slashing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Grell",
    "cr": "3",
    "type": "Medium Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark"],
    "immunities": ["Condition: Blinded, Prone"],
    "traits": [
      "Blind Senses: The grell can't use its blindsight while deafened and unable to smell.",
      "Spider Climb: The grell can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    ],
    "actions": [
      "Multiattack: The grell makes two attacks: one with its tentacles and one with its beak.",
      "Tentacles: Melee Weapon Attack: +4 to hit, reach 10 ft., one creature. Hit: 7 (1d10 + 2) piercing damage, and the target must succeed on a DC 11 Constitution saving throw or be poisoned for 1 minute. Until this poison ends, the target is paralyzed. The target is also grappled (escape DC 15).",
      "Beak: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (2d4 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Grung (Green)",
    "cr": "1/4",
    "type": "Small Humanoid",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Swamp"],
    "immunities": ["Poison damage", "Poisoned condition"],
    "traits": [
      "Amphibious: Can breathe air and water.",
      "Poisonous Skin: Contact requires a DC 12 Con save or target is poisoned for 1 minute.",
      "Standing Leap: Long jump up to 25 ft., high jump up to 15 ft.",
      "Variant Poison (Green): Poisoned creature can't move except to climb or jump."
    ],
    "actions": [
      "Dagger: +4 to hit, 1d4+2 piercing plus 2d4 poison damage (DC 12 Con save)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Grung (Blue)",
    "cr": "1/4",
    "type": "Small Humanoid",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Swamp"],
    "immunities": ["Poison damage", "Poisoned condition"],
    "traits": [
      "Amphibious: Can breathe air and water.",
      "Poisonous Skin: Contact requires a DC 12 Con save or target is poisoned for 1 minute.",
      "Standing Leap: Long jump up to 25 ft., high jump up to 15 ft.",
      "Variant Poison (Blue): Poisoned creature must shout loudly at start and end of turn."
    ],
    "actions": [
      "Dagger: +4 to hit, 1d4+2 piercing plus 2d4 poison damage (DC 12 Con save)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Grung (Purple)",
    "cr": "1/4",
    "type": "Small Humanoid",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Swamp"],
    "immunities": ["Poison damage", "Poisoned condition"],
    "traits": [
      "Amphibious: Can breathe air and water.",
      "Poisonous Skin: Contact requires a DC 12 Con save or target is poisoned for 1 minute.",
      "Standing Leap: Long jump up to 25 ft., high jump up to 15 ft.",
      "Variant Poison (Purple): Poisoned creature must soak in liquid or mud; can't take other actions."
    ],
    "actions": [
      "Dagger: +4 to hit, 1d4+2 piercing plus 2d4 poison damage (DC 12 Con save)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Grung (Red)",
    "cr": "1/4",
    "type": "Small Humanoid",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Swamp"],
    "immunities": ["Poison damage", "Poisoned condition"],
    "traits": [
      "Amphibious: Can breathe air and water.",
      "Poisonous Skin: Contact requires a DC 12 Con save or target is poisoned for 1 minute.",
      "Standing Leap: Long jump up to 25 ft., high jump up to 15 ft.",
      "Variant Poison (Red): Poisoned creature must use its action to eat if food is near."
    ],
    "actions": [
      "Dagger: +4 to hit, 1d4+2 piercing plus 2d4 poison damage (DC 12 Con save)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Grung (Orange)",
    "cr": "1/4",
    "type": "Small Humanoid",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Swamp"],
    "immunities": ["Poison damage", "Poisoned condition"],
    "traits": [
      "Amphibious: Can breathe air and water.",
      "Poisonous Skin: Contact requires a DC 12 Con save or target is poisoned for 1 minute.",
      "Standing Leap: Long jump up to 25 ft., high jump up to 15 ft.",
      "Variant Poison (Orange): Poisoned creature is frightened of its allies."
    ],
    "actions": [
      "Dagger: +4 to hit, 1d4+2 piercing plus 2d4 poison damage (DC 12 Con save)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Grung (Gold)",
    "cr": "1/4",
    "type": "Small Humanoid",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Swamp"],
    "immunities": ["Poison damage", "Poisoned condition"],
    "traits": [
      "Amphibious: Can breathe air and water.",
      "Poisonous Skin: Contact requires a DC 12 Con save or target is poisoned for 1 minute.",
      "Standing Leap: Long jump up to 25 ft., high jump up to 15 ft.",
      "Variant Poison (Gold): Poisoned creature is charmed and can speak Grung."
    ],
    "actions": [
      "Dagger: +4 to hit, 1d4+2 piercing plus 2d4 poison damage (DC 12 Con save)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Grung Elite Warrior",
    "cr": "2",
    "type": "Small Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Forest"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Amphibious: The grung can breathe air and water[cite: 16].",
      "Poisonous Skin: Direct contact with the grung's skin requires a DC 12 Constitution saving throw against being poisoned[cite: 16].",
      "Standing Leap: Long jump up to 25 feet, high jump up to 15 feet[cite: 16]."
    ],
    "actions": [
      "Multiattack: The grung makes two dagger attacks or two shortbow attacks[cite: 16].",
      "Dagger: Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage plus 5 (2d4) poison damage[cite: 16].",
      "Shortbow: Ranged Weapon Attack: +5 to hit, range 80/320 ft., one target. Hit: 5 (1d4 + 3) piercing damage plus 5 (2d4) poison damage[cite: 16].",
      "Mesmerizing Chirp (Recharge 6): The grung makes a unique chirp. Each non-grung creature within 15 feet that can hear it must succeed on a DC 12 Wisdom saving throw or be stunned until the end of the grung's next turn[cite: 16]."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Guardian Drake",
    "cr": "2",
    "type": "Medium Dragon",
    "alignment": "Unaligned",
    "biomes": ["Urban", "Forest", "Mountain"],
    "immunities": ["Varies by type (e.g., Fire for Red, Acid for Black)"],
    "traits": [
      "Draconic Nature: The drake's damage resistance and bite damage type depend on the color of the dragon scales used in its creation[cite: 23]."
    ],
    "actions": [
      "Multiattack: The drake makes two attacks: one with its bite and one with its tail[cite: 23].",
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage plus 3 (1d6) damage of a type determined by its color[cite: 23].",
      "Tail: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage[cite: 23]."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Hill Giant",
    "cr": "5",
    "type": "Huge Giant",
    "alignment": "Chaotic Evil",
    "biomes": ["Hill"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Multiattack: The giant makes two greatclub attacks.",
      "Greatclub: Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 18 (3d8 + 5) bludgeoning damage.",
      "Rock: Ranged Weapon Attack: +8 to hit, range 60/240 ft., one target. Hit: 21 (3d10 + 5) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Iron Golem",
    "cr": "16",
    "type": "Large Construct",
    "alignment": "Unaligned",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Fire, Poison, Psychic damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks that aren't Adamantine", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Petrified, Poisoned"],
    "traits": [
      "Fire Absorption: Whenever the golem is subjected to fire damage, it takes no damage and instead regains a number of hit points equal to the fire damage dealt.",
      "Immutable Form: The golem is immune to any spell or effect that would alter its form.",
      "Magic Resistance: The golem has advantage on saving throws against spells and other magical effects.",
      "Magic Weapons: The golem's weapon attacks are magical."
    ],
    "actions": [
      "Multiattack: The golem makes two melee attacks.",
      "Slam: Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 20 (3d8 + 7) bludgeoning damage.",
      "Sword: Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 23 (3d10 + 7) slashing damage.",
      "Poison Breath (Recharge 5–6): The golem exhales poisonous gas in a 15-foot cone. Each creature in that area must make a DC 19 Constitution saving throw, taking 45 (10d8) poison damage on a failed save, or half as much damage on a successful one."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Jackalwere",
    "cr": "1/2",
    "type": "Medium Humanoid (Shapechanger)",
    "alignment": "Chaotic Evil",
    "biomes": ["Desert", "Grassland"],
    "immunities": ["Bludgeoning, Piercing, and Slashing from Nonmagical Attacks that aren't Silvered"],
    "traits": [
      "Shapechanger: The jackalwere can use its action to polymorph into a specific jackal or a jackal-humanoid hybrid, or back into its true humanoid form.",
      "Keen Hearing and Smell: The jackalwere has advantage on Wisdom (Perception) checks that rely on hearing or smell.",
      "Pack Tactics: The jackalwere has advantage on an attack roll against a creature if at least one of the jackalwere's allies is within 5 feet of the creature and the ally isn't incapacitated."
    ],
    "actions": [
      "Bite (Jackal or Hybrid Form Only): Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage.",
      "Scimitar (Humanoid or Hybrid Form Only): Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage.",
      "Sleep Gaze: The jackalwere gazes at one creature it can see within 30 feet. The target must succeed on a DC 10 Wisdom saving throw or fall unconscious for 10 minutes. This effect ends if the target takes damage or someone uses an action to shake the target awake."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Kenku",
    "cr": "1/4",
    "type": "Medium Humanoid (Kenku)",
    "alignment": "Chaotic Neutral",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Ambusher: In the first round of a combat, the kenku has advantage on attack rolls against any creature it surprised.",
      "Mimicry: The kenku can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 14 Wisdom (Insight) check."
    ],
    "actions": [
      "Shortsword: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage.",
      "Shortbow: Ranged Weapon Attack: +5 to hit, range 80/320 ft., one target. Hit: 6 (1d6 + 3) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Kobold",
    "cr": "1/8",
    "type": "Small Humanoid (Kobold)",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Hill", "Mountain", "Swamp", "Underdark"],
    "immunities": [],
    "traits": [
      "Sunlight Sensitivity: Disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight in direct sunlight.",
      "Pack Tactics: Advantage on attack rolls against a creature if at least one ally is within 5 feet of the creature."
    ],
    "actions": [
      "Dagger: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage.",
      "Sling: Ranged Weapon Attack: +4 to hit, range 30/120 ft., one target. Hit: 4 (1d4 + 2) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Kraken",
    "cr": "23",
    "type": "Gargantuan Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Underwater"],
    "immunities": ["Lightning damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Frightened, Paralyzed"],
    "traits": [
      "Amphibious: The kraken can breathe air and water.",
      "Freedom of Movement: The kraken ignores difficult terrain, and magical effects can't reduce its speed or cause it to be restrained. It can spend 5 feet of movement to escape from nonmagical restraints or being grappled.",
      "Siege Monster: The kraken deals double damage to objects and structures."
    ],
    "actions": [
      "Multiattack: The kraken makes three tentacle attacks, each of which it can replace with one use of Fling.",
      "Bite: Melee Weapon Attack: +17 to hit, reach 5 ft., one target. Hit: 23 (3d8 + 10) piercing damage. If the target is Large or smaller, it is swallowed.",
      "Tentacle: Melee Weapon Attack: +17 to hit, reach 30 ft., one target. Hit: 20 (3d6 + 10) bludgeoning damage, and the target is grappled (escape DC 20).",
      "Lightning Storm: The kraken magically creates three bolts of lightning, each of which can strike a target within 120 feet. Each target must make a DC 23 Dexterity saving throw, taking 22 (4d10) lightning damage on a failure."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Lizardfolk",
    "cr": "1/2",
    "type": "Medium Humanoid (Lizardfolk)",
    "alignment": "Neutral",
    "biomes": ["Coastal", "Swamp"],
    "immunities": [],
    "traits": [
      "Hold Breath: The lizardfolk can hold its breath for 15 minutes."
    ],
    "actions": [
      "Multiattack: The lizardfolk makes two melee attacks, each one with a different weapon.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Heavy Club: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) bludgeoning damage.",
      "Javelin: Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Spiked Shield: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Manticore",
    "cr": "3",
    "type": "Large Monstrosity",
    "alignment": "Lawful Evil",
    "biomes": ["Coastal", "Desert", "Hill", "Mountain"],
    "immunities": [],
    "traits": [
      "Tail Spike Regrowth: The manticore has twenty-four tail spikes. Used spikes regrow when the manticore finishes a long rest."
    ],
    "actions": [
      "Multiattack: The manticore makes three attacks: one with its bite and two with its claws, or three with its tail spikes.",
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage.",
      "Claw: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage.",
      "Tail Spike: Ranged Weapon Attack: +5 to hit, range 100/200 ft., one target. Hit: 7 (1d8 + 3) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Meazel",
    "cr": "1",
    "type": "Medium Monstrosity",
    "alignment": "Lawful Evil",
    "biomes": ["Desert", "Forest", "Grassland", "Hill", "Mountain", "Swamp", "Underdark", "Urban"],
    "immunities": [],
    "traits": [
      "Shadow Stealth: While in dim light or darkness, the meazel can take the Hide action as a bonus action."
    ],
    "actions": [
      "Garrote: Melee Weapon Attack: +5 to hit, reach 5 ft., one Medium or smaller creature. Hit: 6 (1d6 + 3) bludgeoning damage, and the target is grappled (escape DC 13). Until the grapple ends, the target can't breathe and takes 10 (2d6 + 3) bludgeoning damage at the start of each of the meazel's turns.",
      "Shadow Teleport (Recharge 5–6): The meazel, along with any creature it is grappling, teleports up to 60 feet to an unoccupied space it can see that is in dim light or darkness."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Medusa",
    "cr": "6",
    "type": "Medium Monstrosity",
    "alignment": "Lawful Evil",
    "biomes": ["Desert", "Mountain", "Underdark", "Urban"],
    "immunities": [],
    "traits": [
      "Petrifying Gaze: When a creature that can see the medusa's eyes starts its turn within 30 feet of her, the medusa can force it to make a DC 14 Constitution saving throw. If the saving throw fails by 5 or more, the creature is instantly petrified. Otherwise, a creature that fails the save begins to turn to stone and is restrained."
    ],
    "actions": [
      "Multiattack: The medusa makes either three melee attacks—one with her snake hair and two with her shortsword—or two ranged attacks with her longbow.",
      "Snake Hair: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage plus 14 (4d6) poison damage.",
      "Shortsword: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Longbow: Ranged Weapon Attack: +5 to hit, range 150/600 ft., one target. Hit: 6 (1d8 + 2) piercing damage plus 7 (2d6) poison damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Merfolk",
    "cr": "1/8",
    "type": "Medium Humanoid (Merfolk)",
    "alignment": "Neutral",
    "biomes": ["Coastal", "Underwater"],
    "immunities": [],
    "traits": [
      "Amphibious: The merfolk can breathe air and water."
    ],
    "actions": [
      "Spear: Melee or Ranged Weapon Attack: +2 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 3 (1d6) piercing damage, or 4 (1d8) piercing damage if used with two hands to make a melee attack."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Merrow",
    "cr": "2",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Coastal", "Underwater"],
    "immunities": [],
    "traits": [
      "Amphibious: The merrow can breathe air and water."
    ],
    "actions": [
      "Multiattack: The merrow makes two attacks: one with its bite and one with its claws or harpoon.",
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) piercing damage.",
      "Claws: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 9 (2d4 + 4) slashing damage.",
      "Harpoon: Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 11 (2d6 + 4) piercing damage. If the target is a creature, it must succeed on a Strength contest against the merrow or be pulled up to 20 feet toward the merrow."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Mimic",
    "cr": "2",
    "type": "Medium Monstrosity (Shapechanger)",
    "alignment": "Neutral",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Condition: Grappled, Prone"],
    "traits": [
      "Shapechanger: The mimic can use its action to polymorph into an object or back into its true, amorphous form.",
      "Adhesive (Object Form Only): The mimic adheres to anything that touches it. A Huge or smaller creature adhered to the mimic is also grappled by it (escape DC 13).",
      "False Appearance (Object Form Only): While the mimic remains motionless, it is indistinguishable from an ordinary object."
    ],
    "actions": [
      "Pseudopod: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage. If the mimic is in object form, the target is subjected to its Adhesive trait.",
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage plus 4 (1d8) acid damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Mind Flayer",
    "cr": "7",
    "type": "Medium Aberration",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The mind flayer has advantage on saving throws against spells and other magical effects.",
      "Innate Spellcasting (Psionics): Ability is Intelligence (save DC 15). At will: detect thoughts, levitate."
    ],
    "actions": [
      "Tentacles: Melee Weapon Attack: +7 to hit, reach 5 ft., one creature. Hit: 15 (2d10 + 4) psychic damage. If the target is Medium or smaller, it is grappled (escape DC 15) and must succeed on a DC 15 Intelligence saving throw or be stunned until the grapple ends.",
      "Extract Brain: Melee Weapon Attack: +7 to hit, reach 5 ft., one incapacitated humanoid grappled by the mind flayer. Hit: 55 (10d10) piercing damage. If this damage reduces the target to 0 hit points, the mind flayer kills the target by extracting and devouring its brain.",
      "Mind Blast (Recharge 5–6): The mind flayer magically emits psychic energy in a 60-foot cone. Each creature in that area must succeed on a DC 15 Intelligence saving throw or take 22 (4d8 + 4) psychic damage and be stunned for 1 minute."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Minotaur",
    "cr": "3",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark", "Labyrinth"],
    "immunities": [],
    "traits": [
      "Charge: If the minotaur moves at least 10 feet straight toward a target and then hits it with a gore attack on the same turn, the target takes an extra 9 (2d8) piercing damage. If the target is a creature, it must succeed on a DC 14 Strength saving throw or be pushed up to 10 feet away and knocked prone.",
      "Labyrinthine Recall: The minotaur can perfectly recall any path it has traveled."
    ],
    "actions": [
      "Greataxe: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 17 (2d12 + 4) slashing damage.",
      "Gore: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Mummy",
    "cr": "3",
    "type": "Medium Undead",
    "alignment": "Lawful Evil",
    "biomes": ["Desert", "Underdark"],
    "immunities": ["Necrotic, Poison damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Poisoned"],
    "traits": [],
    "actions": [
      "Multiattack: The mummy can use its Dreadful Glare and makes one attack with its rotting fist.",
      "Rotting Fist: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage plus 10 (3d6) necrotic damage. If the target is a creature, it must succeed on a DC 12 Constitution saving throw or be cursed with mummy rot. The cursed target can't regain hit points, and its hit point maximum decreases by 10 (3d6) for every 24 hours that elapse.",
      "Dreadful Glare: The mummy targets one creature it can see within 60 feet. If the target can see the mummy, it must succeed on a DC 11 Wisdom saving throw or become frightened until the end of the mummy's next turn. If the target fails the saving throw by 5 or more, it is also paralyzed for the same duration."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Myconid Adult",
    "cr": "1/2",
    "type": "Medium Plant",
    "alignment": "Lawful Neutral",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Distress Spores: When the myconid takes damage, all other myconids within 240 feet can sense its pain.",
      "Sun Sickness: While in sunlight, the myconid has disadvantage on ability checks, attack rolls, and saving throws. The myconid dies if it spends more than 1 hour in direct sunlight."
    ],
    "actions": [
      "Fist: Melee Weapon Attack: +2 to hit, reach 5 ft., one target. Hit: 5 (2d4) bludgeoning damage plus 5 (2d4) poison damage.",
      "Pacifying Spores (3/Day): The myconid ejects spores at one creature it can see within 5 feet. The target must succeed on a DC 11 Constitution saving throw or be stunned for 1 minute. The target can repeat the saving throw at the end of each of its turns.",
      "Rapport Spores: A 20-foot radius of spores extends from the myconid. These spores can go around corners and affect only creatures with an Intelligence of 2 or higher that aren't Undead, Constructs, or Elementals. Affected creatures can communicate telepathically with one another while they are within 30 feet of each other. The effect lasts for 1 hour."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Naga (Bone)",
    "cr": "4",
    "type": "Large Undead",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Poison damage", "Condition: Charmed, Exhaustion, Paralyzed, Poisoned"],
    "traits": [
      "Spellcasting: The naga is a 5th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 12, +4 to hit with spell attacks). It has the following wizard spells prepared: \nCantrips (at will): mage hand, minor illusion, ray of frost\n1st level (4 slots): charm person, sleep\n2nd level (3 slots): detect thoughts, hold person\n3rd level (2 slots): lightning bolt"
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 10 ft., one creature. Hit: 10 (2d6 + 3) piercing damage plus 10 (3d6) poison damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Naga (Guardian)",
    "cr": "10",
    "type": "Large Celestial",
    "alignment": "Lawful Good",
    "biomes": ["Forest", "Urban"],
    "immunities": ["Poison damage", "Condition: Charmed, Poisoned"],
    "traits": [
      "Rejuvenation: If it dies, the naga returns to life in 1d6 days and regains all its hit points. Only a wish spell can prevent this trait from functioning.",
      "Spellcasting: The naga is an 11th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 16, +8 to hit with spell attacks). It has the following cleric spells prepared:\nCantrips (at will): mending, sacred flame, thaumaturgy\n1st level (4 slots): command, cure wounds, shield of faith\n2nd level (3 slots): calm emotions, hold person\n3rd level (3 slots): bestow curse, clairvoyance, dispel magic\n4th level (3 slots): banishment, freedom of movement\n5th level (2 slots): flame strike, geas\n6th level (1 slot): true seeing"
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +8 to hit, reach 10 ft., one creature. Hit: 8 (1d8 + 4) piercing damage, and the target must make a DC 15 Constitution saving throw, taking 45 (10d8) poison damage on a failed save, or half as much damage on a successful one.",
      "Spit Poison: Ranged Weapon Attack: +8 to hit, range 15/30 ft., one creature. Hit: The target must make a DC 15 Constitution saving throw, taking 45 (10d8) poison damage on a failed save, or half as much damage on a successful one."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Naga (Spirit)",
    "cr": "8",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Swamp", "Underdark"],
    "immunities": ["Poison damage", "Condition: Charmed, Poisoned"],
    "traits": [
      "Rejuvenation: If it dies, the naga returns to life in 1d6 days and regains all its hit points. Only a wish spell can prevent this trait from functioning.",
      "Spellcasting: The naga is a 10th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). It has the following wizard spells prepared:\nCantrips (at will): mage hand, minor illusion, ray of frost\n1st level (4 slots): charm person, detect magic, sleep\n2nd level (3 slots): detect thoughts, hold person\n3rd level (3 slots): lightning bolt, water breathing\n4th level (3 slots): blight, dimension door\n5th level (2 slots): dominate person"
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +7 to hit, reach 10 ft., one creature. Hit: 7 (1d6 + 4) piercing damage, and the target must make a DC 13 Constitution saving throw, taking 31 (7d8) poison damage on a failed save, or half as much damage on a successful one."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Nightmare",
    "cr": "3",
    "type": "Large Fiend",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Fire damage"],
    "traits": [
      "Confer Fire Resistance: The nightmare can grant resistance to fire damage to anyone riding it.",
      "Illumination: The nightmare sheds bright light in a 10-foot radius and dim light for an additional 10 feet."
    ],
    "actions": [
      "Hooves: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage plus 7 (2d6) fire damage.",
      "Ethereal Stride (Recharge 4–6): The nightmare and up to three willing creatures within 5 feet of it magically enter the Ethereal Plane from the Material Plane, or vice versa."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Nilbog",
    "cr": "1",
    "type": "Small Fey",
    "alignment": "Any Alignment",
    "biomes": ["Forest", "Hill", "Underdark"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Charisma (save DC 12). At will: mage hand, prestidigitation, vicious mockery; 1/day each: confusion, dancing lights, hideous laughter.",
      "Nilbogism: Any creature that attempts to damage the nilbog must first succeed on a DC 12 Charisma saving throw or be charmed until the end of its next turn. A creature charmed in this way must use its action to praise the nilbog.",
      "Nimble Escape: The nilbog can take the Disengage or Hide action as a bonus action on each of its turns.",
      "Reversal of Fortune: In response to taking damage, the nilbog reduces the damage to 0 and regains 1d6 hit points."
    ],
    "actions": [
      "Fool's Scepter: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) bludgeoning damage. At the nilbog's discretion, a creature hit by the scepter must succeed on a DC 12 Charisma saving throw or be charmed until the end of its next turn."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Nothic",
    "cr": "2",
    "type": "Medium Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Keen Sight: The nothic has advantage on Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Multiattack: The nothic makes two claw attacks.",
      "Claw: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) slashing damage.",
      "Rotting Gaze: The nothic targets one creature it can see within 30 feet of it. The target must succeed on a DC 12 Constitution saving throw or take 10 (3d6) necrotic damage.",
      "Weird Insight: The nothic targets one creature it can see within 30 feet of it. The target must contest its Charisma (Deception) check against the nothic’s Wisdom (Insight) check. If the nothic wins, it magically learns one fact or secret about the target."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ogre",
    "cr": "2",
    "type": "Large Giant",
    "alignment": "Chaotic Evil",
    "biomes": ["Coastal", "Desert", "Forest", "Grassland", "Hill", "Mountain", "Swamp", "Underdark"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Greatclub: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.",
      "Javelin: Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 11 (2d6 + 4) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Oni",
    "cr": "7",
    "type": "Large Giant",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Urban"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Charisma (save DC 13). At will: darkness, invisibility; 1/day each: charm person, cone of cold, gaseous form, sleep.",
      "Magic Weapons: The oni's weapon attacks are magical.",
      "Regeneration: The oni regains 10 hit points at the start of its turn if it has at least 1 hit point."
    ],
    "actions": [
      "Multiattack: The oni makes two attacks, either with its claws or its glaive.",
      "Claw (Oni Form Only): Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) slashing damage.",
      "Glaive: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 15 (2d10 + 4) slashing damage, or 9 (1d10 + 4) slashing damage if used in Medium form.",
      "Change Shape: The oni magically polymorphs into a Small or Medium humanoid, into a Large giant, or back into its true form."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Otyugh",
    "cr": "5",
    "type": "Large Aberration",
    "alignment": "Neutral",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Limited Telepathy: The otyugh can magically transmit simple messages and images to any creature within 120 feet of it that can understand a language."
    ],
    "actions": [
      "Multiattack: The otyugh makes three attacks: one with its bite and two with its tentacles.",
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) piercing damage. If the target is a creature, it must succeed on a DC 15 Constitution saving throw or take 10 (3d6) poison damage and be poisoned until it finishes a short or long rest.",
      "Tentacle: Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage plus 4 (1d8) piercing damage. If the target is Medium or smaller, it is grappled (escape DC 13) and restrained until the grapple ends.",
      "Tentacle Slam: The otyugh slams creatures grappled by it into each other or a solid surface. Each creature must succeed on a DC 14 Strength saving throw or take 10 (2d6 + 3) bludgeoning damage and be stunned until the end of the otyugh's next turn."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Owlbear",
    "cr": "3",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "Keen Sight and Smell: The owlbear has advantage on Wisdom (Perception) checks that rely on sight or smell."
    ],
    "actions": [
      "Multiattack: The owlbear makes two attacks: one with its beak and one with its claws.",
      "Beak: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (1d10 + 5) piercing damage.",
      "Claws: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Pegasus",
    "cr": "2",
    "type": "Large Celestial",
    "alignment": "Chaotic Good",
    "biomes": ["Coastal", "Grassland", "Hill", "Mountain"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Hooves: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Peryton",
    "cr": "2",
    "type": "Medium Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Mountain"],
    "immunities": ["Bludgeoning, Piercing, and Slashing from Nonmagical attacks"],
    "traits": [
      "Dive Attack: If the peryton is flying and dives at least 30 feet straight toward a target and then hits it with a melee weapon attack, the attack deals an extra 9 (2d8) damage to the target.",
      "Flyby: The peryton doesn't provoke opportunity attacks when it flies out of an enemy's reach.",
      "Keen Sight and Smell: The peryton has advantage on Wisdom (Perception) checks that rely on sight or smell."
    ],
    "actions": [
      "Multiattack: The peryton makes two attacks: one with its antlers and one with its talons.",
      "Antlers: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage.",
      "Talons: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 8 (2d4 + 3) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Pixie",
    "cr": "1/4",
    "type": "Tiny Fey",
    "alignment": "Neutral Good",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The pixie has advantage on saving throws against spells and other magical effects.",
      "Innate Spellcasting: Ability is Charisma (save DC 12). \nAt will: druidcraft\n1/day each: confusion, dancing lights, detect evil and good, detect thoughts, dispel magic, entangle, fly, phantasmal force, polymorph, sleep"
    ],
    "actions": [
      "Superior Invisibility: The pixie magically turns invisible until its concentration ends (as if concentrating on a spell). Any equipment the pixie wears or carries is invisible with it."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Pseudodragon",
    "cr": "1/4",
    "type": "Tiny Dragon",
    "alignment": "Neutral Good",
    "biomes": ["Forest", "Urban"],
    "immunities": [],
    "traits": [
      "Keen Senses: The pseudodragon has advantage on Wisdom (Perception) checks that rely on sight, hearing, or smell.",
      "Magic Resistance: The pseudodragon has advantage on saving throws against spells and other magical effects.",
      "Limited Telepathy: The pseudodragon can magically communicate simple ideas, emotions, and images telepathically with any creature within 100 feet of it that can understand a language."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage.",
      "Sting: Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. Hit: 4 (1d4 + 2) piercing damage, and the target must succeed on a DC 11 Constitution saving throw or become poisoned for 1 hour. If the saving throw fails by 5 or more, the target falls unconscious for the same duration."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Quickling",
    "cr": "1",
    "type": "Tiny Fey",
    "alignment": "Chaotic Evil",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "Blurred Movement: Attack rolls against the quickling have disadvantage unless it is incapacitated or its speed is 0.",
      "Evasion: If the quickling is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."
    ],
    "actions": [
      "Multiattack: The quickling makes three dagger attacks.",
      "Dagger: Melee or Ranged Weapon Attack: +8 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 8 (1d4 + 6) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Rakshasa",
    "cr": "13",
    "type": "Medium Fiend",
    "alignment": "Lawful Evil",
    "biomes": ["Urban"],
    "immunities": ["Bludgeoning, Piercing, and Slashing from Nonmagical attacks"],
    "traits": [
      "Limited Magic Immunity: The rakshasa can't be affected or detected by spells of 6th level or lower unless it wishes to be. It has advantage on saving throws against all other spells and magical effects.",
      "Innate Spellcasting: Ability is Charisma (save DC 18, +10 to hit with spell attacks). \nAt will: detect thoughts, disguise self, mage hand, minor illusion\n3/day each: charm person, detect magic, invisibility, major image, suggestion\n1/day each: dominate person, fly, plane shift, true seeing"
    ],
    "actions": [
      "Multiattack: The rakshasa makes two claw attacks.",
      "Claw: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) slashing damage, and the target is cursed if it is a creature. The magical curse takes effect whenever the target takes a short or long rest, filling the target's thoughts with horrible images and dreams. The cursed target gains no benefit from finishing a short or long rest."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Remorhaz",
    "cr": "11",
    "type": "Huge Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Arctic"],
    "immunities": ["Cold, Fire damage"],
    "traits": [
      "Heated Body: A creature that touches the remorhaz or hits it with a melee attack while within 5 feet of it takes 10 (3d6) fire damage."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 40 (6d10 + 7) piercing damage plus 10 (3d6) fire damage. If the target is a creature, it is grappled (escape DC 17). Until this grapple ends, the target is restrained, and the remorhaz can't bite another target.",
      "Swallow: The remorhaz makes one bite attack against a Large or smaller creature it is grappling. If the attack hits, the target is swallowed, and the grapple ends."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Revenant",
    "cr": "5",
    "type": "Medium Undead",
    "alignment": "Neutral",
    "biomes": ["Urban"],
    "immunities": ["Poison damage", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Poisoned, Stunned"],
    "traits": [
      "Regeneration: The revenant regains 10 hit points at the start of its turn. If the revenant takes fire or radiant damage, this trait doesn't function at the start of its next turn.",
      "Rejuvenation: When the revenant's body is destroyed, its soul lingers. After 24 hours, the soul inhabits and animates another humanoid corpse on the same plane of existence and regains all its hit points."
    ],
    "actions": [
      "Multiattack: The revenant makes two fist attacks.",
      "Fist: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage. If the target is a creature against which the revenant has a vendetta, it takes an extra 14 (4d6) bludgeoning damage and the target is grappled (escape DC 14).",
      "Vengeful Glare: The revenant targets one creature it can see within 30 feet of it against which it has a vendetta. The target must make a DC 15 Wisdom saving throw. On a failure, the target is paralyzed until the revenant deals damage to it or until the end of the revenant's next turn."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Roc",
    "cr": "11",
    "type": "Gargantuan Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Coastal", "Desert", "Hill", "Mountain"],
    "immunities": [],
    "traits": [
      "Keen Sight: The roc has advantage on Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Multiattack: The roc makes two attacks: one with its beak and one with its talons.",
      "Beak: Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 27 (4d8 + 9) piercing damage.",
      "Talons: Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 23 (4d6 + 9) slashing damage, and the target is grappled (escape DC 19). Until this grapple ends, the target is restrained."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Roper",
    "cr": "5",
    "type": "Large Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "False Appearance: While the roper remains motionless, it is indistinguishable from a cave formation, such as a stalagmite.",
      "Grasping Tendrils: The roper can have up to six tendrils at a time. Each tendril can be attacked (AC 20; 10 hit points; immunity to poison and psychic damage)."
    ],
    "actions": [
      "Multiattack: The roper makes four attacks with its tendrils, uses Reel, and makes one attack with its bite.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 22 (4d8 + 4) piercing damage.",
      "Tendril: Melee Weapon Attack: +7 to hit, reach 50 ft., one creature. Hit: The target is grappled (escape DC 15). Until the grapple ends, the target is restrained and has disadvantage on Strength checks and Strength saving throws.",
      "Reel: The roper pulls each creature grappled by it up to 25 feet straight toward it."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Sahuagin",
    "cr": "1/2",
    "type": "Medium Humanoid (Sahuagin)",
    "alignment": "Lawful Evil",
    "biomes": ["Coastal", "Underwater"],
    "immunities": [],
    "traits": [
      "Blood Frenzy: The sahuagin has advantage on melee attack rolls against any creature that doesn't have all its hit points.",
      "Limited Amphibiousness: The sahuagin can breathe air and water, but it needs to be submerged at least once every 4 hours to avoid suffocating.",
      "Shark Telepathy: The sahuagin can magically command any shark within 120 feet of it, using a limited form of telepathy."
    ],
    "actions": [
      "Multiattack: The sahuagin makes two attacks: one with its bite and one with its claws or spear.",
      "Bite: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 3 (1d4 + 1) piercing damage.",
      "Claws: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 3 (1d4 + 1) slashing damage.",
      "Spear: Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 4 (1d6 + 1) piercing damage, or 5 (1d8 + 1) piercing damage if used with two hands to make a melee attack."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Salamander",
    "cr": "5",
    "type": "Large Elemental",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark"],
    "immunities": ["Fire damage"],
    "traits": [
      "Heated Body: A creature that touches the salamander or hits it with a melee attack while within 5 feet of it takes 7 (2d6) fire damage.",
      "Heated Weapons: Any metal weapon the salamander wields deals an extra 3 (1d6) fire damage on a hit (included in the attack)."
    ],
    "actions": [
      "Multiattack: The salamander makes two attacks: one with its spear and one with its tail.",
      "Spear: Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 11 (2d6 + 4) piercing damage plus 3 (1d6) fire damage.",
      "Tail: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage plus 7 (2d6) fire damage, and the target is grappled (escape DC 14). Until this grapple ends, the target is restrained."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Satyr",
    "cr": "1/2",
    "type": "Medium Fey",
    "alignment": "Chaotic Neutral",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The satyr has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Ram: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 6 (2d4 + 1) bludgeoning damage.",
      "Shortsword: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage.",
      "Shortbow: Ranged Weapon Attack: +5 to hit, range 80/320 ft., one target. Hit: 6 (1d6 + 3) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Scarecrow",
    "cr": "1",
    "type": "Medium Construct",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban"],
    "immunities": ["Poison damage", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Poisoned, Unconscious"],
    "traits": [
      "False Appearance: While the scarecrow remains motionless, it is indistinguishable from an ordinary, inanimate scarecrow."
    ],
    "actions": [
      "Multiattack: The scarecrow makes two claw attacks.",
      "Claw: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 6 (2d4 + 1) slashing damage. If the target is a creature, it must succeed on a DC 11 Wisdom saving throw or be frightened until the end of the scarecrow's next turn.",
      "Terrifying Glare: The scarecrow targets one creature it can see within 30 feet of it. If the target can see the scarecrow, the target must succeed on a DC 11 Wisdom saving throw or be magically frightened until the end of the scarecrow's next turn. The frightened target is paralyzed."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Sea Spawn",
    "cr": "1",
    "type": "Medium Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Coastal", "Underwater"],
    "immunities": [],
    "traits": [
      "Amphibious: The sea spawn can breathe air and water.",
      "Piscine Anatomy: The sea spawn has one or more of the following traits: \n- *Antennae:* The sea spawn has blindsight to a radius of 30 feet. \n- *Cilia:* The sea spawn has advantage on Dexterity (Stealth) checks made while underwater. \n- *Pressure Adaptation:* The sea spawn can survive at depths of up to 10,000 feet."
    ],
    "actions": [
      "Multiattack: The sea spawn makes three attacks: two with its unarmed strikes and one with its fish weapon.",
      "Unarmed Strike: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) bludgeoning damage.",
      "Fish Weapon: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Shadow",
    "cr": "1/2",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Necrotic, Poison damage", "Condition: Exhaustion, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Amorphous: The shadow can move through a space as narrow as 1 inch wide without squeezing.",
      "Shadow Stealth: While in dim light or darkness, the shadow can take the Hide action as a bonus action.",
      "Sunlight Weakness: While in sunlight, the shadow has disadvantage on attack rolls, ability checks, and saving throws."
    ],
    "actions": [
      "Strength Drain: Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. Hit: 9 (2d6 + 2) necrotic damage, and the target's Strength score is reduced by 1d4. The target dies if this reduces its Strength to 0. Otherwise, the reduction lasts until the target finishes a short or long rest."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Shambling Mound",
    "cr": "5",
    "type": "Large Plant",
    "alignment": "Unaligned",
    "biomes": ["Forest", "Swamp"],
    "immunities": ["Lightning damage", "Condition: Blinded, Deafened, Exhaustion"],
    "traits": [
      "Lightning Absorption: Whenever the shambling mound is subjected to lightning damage, it takes no damage and regains a number of hit points equal to the lightning damage dealt."
    ],
    "actions": [
      "Multiattack: The shambling mound makes two slam attacks. If both attacks hit a Medium or smaller target, the target is grappled (escape DC 14), and the shambling mound uses its Engulf on it.",
      "Slam: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.",
      "Engulf: The shambling mound engulfs a Medium or smaller creature grappled by it. The engulfed target is blinded, restrained, and unable to breathe, and it must succeed on a DC 14 Constitution saving throw at the start of each of the mound's turns or take 13 (2d8 + 4) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Shield Guardian",
    "cr": "7",
    "type": "Large Construct",
    "alignment": "Unaligned",
    "biomes": ["Urban"],
    "immunities": ["Poison damage", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Poisoned"],
    "traits": [
      "Bound: The shield guardian is magically bound to an amulet. As long as the guardian and its amulet are on the same plane of existence, the amulet's wearer can telepathically call the guardian to travel to them.",
      "Regeneration: The shield guardian regains 10 hit points at the start of its turn if it has at least 1 hit point.",
      "Spell Storing: A spellcaster who wears the amulet can cause the guardian to store one spell of 4th level or lower."
    ],
    "actions": [
      "Multiattack: The guardian makes two fist attacks.",
      "Fist: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage.",
      "Shield: When a creature makes an attack against the wearer of the guardian's amulet, the guardian grants a +2 bonus to the wearer's AC if the guardian is within 5 feet of the wearer."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Skeleton",
    "cr": "1/4",
    "type": "Medium Undead",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Poison damage", "Condition: Exhaustion, Poisoned"],
    "traits": [],
    "actions": [
      "Shortsword: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Shortbow: Ranged Weapon Attack: +4 to hit, range 80/320 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Skulk",
    "cr": "1/2",
    "type": "Medium Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Coastal", "Forest", "Swamp", "Underdark", "Urban"],
    "immunities": [],
    "traits": [
      "Fallible Invisibility: The skulk is invisible. This invisibility can be bypassed only by a few specific means, such as a *see invisibility* spell or the reflection of the skulk in a mirror.",
      "Trackless: The skulk leaves no physical evidence of its passage, and it can't be tracked except by magical means."
    ],
    "actions": [
      "Claws: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage. If the skulk has advantage on the attack roll, the attack deals an extra 7 (2d6) damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Specter",
    "cr": "1",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Necrotic, Poison damage", "Condition: Charmed, Exhaustion, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Incorporeal Movement: The specter can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.",
      "Sunlight Sensitivity: While in sunlight, the specter has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Life Drain: Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. Hit: 10 (3d6) necrotic damage. The target must succeed on a DC 10 Constitution saving throw or its hit point maximum is reduced by an amount equal to the damage taken."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Sprite",
    "cr": "1/4",
    "type": "Tiny Fey",
    "alignment": "Neutral Good",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Longsword: Melee Weapon Attack: +2 to hit, reach 5 ft., one target. Hit: 1 slashing damage.",
      "Shortbow: Ranged Weapon Attack: +6 to hit, range 40/160 ft., one target. Hit: 1 piercing damage, and the target must succeed on a DC 10 Constitution saving throw or become poisoned for 1 minute. If the save fails by 5 or more, the target falls unconscious.",
      "Heartsight: The sprite touches a creature and magically knows the creature's current emotional state. If the target fails a DC 10 Charisma saving throw, the sprite also knows the creature's alignment.",
      "Invisibility: The sprite magically turns invisible until it attacks or casts a spell, or until its concentration ends."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Star Spawn Grue",
    "cr": "1/4",
    "type": "Small Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": [],
    "traits": [
      "Aura of Shririeking: While within 20 feet of the grue, any creature that isn't an aberration has disadvantage on saving throws.",
      "Conduit of Vacuity: If a creature within 20 feet of the grue is targeted by a spell, the grue can use its reaction to become the target instead."
    ],
    "actions": [
      "Confounding Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) piercing damage, and the target must succeed on a DC 10 Wisdom saving throw or have disadvantage on its next attack roll until the end of its next turn."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Star Spawn Hulk",
    "cr": "10",
    "type": "Large Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Psychic damage"],
    "traits": [
      "Psychic Mirror: If the hulk takes psychic damage, each creature within 10 feet of it takes that damage instead; the hulk takes no damage. In addition, the hulk's sight is not blocked by magical darkness."
    ],
    "actions": [
      "Multiattack: The hulk makes two slam attacks.",
      "Slam: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 14 (2d8 + 5) bludgeoning damage plus 7 (2d6) psychic damage.",
      "Reaping Arms (Recharge 5–6): The hulk makes a separate slam attack against each creature within 10 feet of it. Each creature hit is also knocked prone."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Star Spawn Larva Mage",
    "cr": "16",
    "type": "Medium Aberration",
    "alignment": "Chaotic Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Psychic damage", "Condition: Charmed, Frightened, Paralyzed, Petrified, Poisoned, Restrained"],
    "traits": [
      "Innate Spellcasting: Ability is Charisma (save DC 19). At will: detect magic, guidance, mage hand, prestidigitation; 3/day each: charm person, confusion, dispel magic, hold person; 1/day each: dominate monster, plane shift (self only).",
      "Return to Worms: When the mage dies, it collapses into a swarm of insects in its space."
    ],
    "actions": [
      "Multiattack: The mage makes three Slam attacks or three Eldritch Blast attacks.",
      "Slam: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage plus 18 (4d8) necrotic damage.",
      "Eldritch Blast: Ranged Spell Attack: +11 to hit, range 120 ft., one target. Hit: 10 (1d10 + 5) force damage.",
      "Plague of Worms (Recharge 6): Each creature within 20 feet of the mage must make a DC 19 Dexterity saving throw, taking 33 (6d10) necrotic damage on a failure and is blinded by worms until the end of the mage's next turn."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Star Spawn Mangler",
    "cr": "5",
    "type": "Medium Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": [],
    "traits": [
      "Ambush: On the first round of each combat, the mangler has advantage on attack rolls against any creature that hasn't taken a turn yet.",
      "Shadow Stealth: While in dim light or darkness, the mangler can take the Hide action as a bonus action."
    ],
    "actions": [
      "Multiattack: The mangler makes two claw attacks.",
      "Claw: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) slashing damage. If the mangler had advantage on the attack roll, the target also takes 7 (2d6) psychic damage.",
      "Flurry of Claws (Recharge 4–6): The mangler makes six claw attacks. It can use this action only if it is in dim light or darkness."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Star Spawn Seer",
    "cr": "13",
    "type": "Medium Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Psychic damage", "Condition: Charmed, Frightened"],
    "traits": [
      "Out-of-Phase Movement: The seer can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    ],
    "actions": [
      "Multiattack: The seer makes two Comet Staff attacks or two Psychic Orb attacks.",
      "Comet Staff: Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 9 (1d6 + 6) bludgeoning damage plus 18 (4d8) psychic damage, and the target is pushed up to 10 feet away.",
      "Psychic Orb: Ranged Spell Attack: +11 to hit, range 120 ft., one target. Hit: 27 (5d10) psychic damage.",
      "Collapse Distance (Recharge 6): The seer warps space around a point it can see within 60 feet. Each creature within 20 feet of that point must make a DC 19 Wisdom saving throw. On a failure, a target takes 33 (6d10) psychic damage and is teleported to an unoccupied space within 5 feet of the seer."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Stone Giant",
    "cr": "7",
    "type": "Huge Giant",
    "alignment": "Neutral",
    "biomes": ["Mountain", "Underdark"],
    "immunities": [],
    "traits": [
      "Stone Camouflage: The giant has advantage on Dexterity (Stealth) checks made to hide in rocky terrain."
    ],
    "actions": [
      "Multiattack: The giant makes two greatclub attacks.",
      "Greatclub: Melee Weapon Attack: +9 to hit, reach 15 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage.",
      "Rock: Ranged Weapon Attack: +9 to hit, range 60/240 ft., one target. Hit: 28 (4d10 + 6) bludgeoning damage. If the target is a creature, it must succeed on a DC 17 Strength saving throw or be knocked prone."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Succubus/Incubus",
    "cr": "4",
    "type": "Medium Fiend (Shapechanger)",
    "alignment": "Neutral Evil",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Telepathic Bond: The fiend ignores the range restriction on its telepathy when communicating with a creature it has charmed. The two don't even need to be on the same plane of existence.",
      "Shapechanger: The fiend can use its action to polymorph into a Small or Medium humanoid, or back into its true form."
    ],
    "actions": [
      "Claw (Fiend Form Only): Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage.",
      "Charm: One humanoid the fiend can see within 30 feet of it must succeed on a DC 15 Wisdom saving throw or be magically charmed for 1 day.",
      "Draining Kiss: The fiend kisses a creature charmed by it or a willing creature. The target must make a DC 15 Constitution saving throw against this magic, taking 32 (5d10 + 5) psychic damage on a failed save.",
      "Etherealness: The fiend magically enters the Ethereal Plane from the Material Plane, or vice versa."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Tarrasque",
    "cr": "30",
    "type": "Gargantuan Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Any"],
    "immunities": ["Fire, Poison, Psychic damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Charmed, Frightened, Paralyzed, Poisoned"],
    "traits": [
      "Legendary Resistance (3/Day): If the tarrasque fails a saving throw, it can choose to succeed instead.",
      "Magic Resistance: The tarrasque has advantage on saving throws against spells and other magical effects.",
      "Reflective Carapace: Any time the tarrasque is targeted by a magic missile spell, a line spell, or a spell that requires a ranged attack roll, roll a d6. On a 1 to 5, the tarrasque is unaffected. On a 6, the tarrasque is unaffected, and the effect is reflected back at the caster.",
      "Siege Monster: The tarrasque deals double damage to objects and structures."
    ],
    "actions": [
      "Multiattack: The tarrasque can use its Frightful Presence. It then makes five attacks: one with its bite, two with its claws, one with its horns, and one with its tail. It can use its Swallow instead of its bite.",
      "Bite: Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 36 (4d12 + 10) piercing damage. If the target is a creature, it is grappled (escape DC 20).",
      "Claw: Melee Weapon Attack: +19 to hit, reach 15 ft., one target. Hit: 28 (4d8 + 10) slashing damage.",
      "Horns: Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 32 (4d10 + 10) bludgeoning damage.",
      "Tail: Melee Weapon Attack: +19 to hit, reach 20 ft., one target. Hit: 24 (4d6 + 10) bludgeoning damage.",
      "Frightful Presence: Each creature of the tarrasque's choice within 120 feet must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute.",
      "Swallow: The tarrasque makes one bite attack against a Large or smaller creature it is grappling. If the attack hits, the target is swallowed, and the grapple ends."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Thri-kreen",
    "cr": "1",
    "type": "Medium Humanoid",
    "alignment": "Chaotic Neutral",
    "biomes": ["Desert", "Grassland"],
    "immunities": [],
    "traits": [
      "Chameleon Carapace: The thri-kreen can change the color of its carapace to match the color and texture of its surroundings. As a result, it has advantage on Dexterity (Stealth) checks made to hide.",
      "Standing Leap: The thri-kreen's long jump is up to 30 feet and its high jump is up to 15 feet, with or without a running start."
    ],
    "actions": [
      "Multiattack: The thri-kreen makes two attacks: one with its bite and one with its claws.",
      "Bite: Melee Weapon Attack: +3 to hit, reach 5 ft., one creature. Hit: 4 (1d6 + 1) piercing damage, and the target must succeed on a DC 11 Constitution saving throw or be poisoned for 1 minute. If the saving throw fails by 5 or more, the target is also paralyzed while poisoned in this way.",
      "Claws: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 6 (2d4 + 1) slashing damage.",
      "Gythka: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 5 (1d8 + 1) slashing damage.",
      "Chatkcha: Ranged Weapon Attack: +4 to hit, range 30/120 ft., one target. Hit: 5 (1d6 + 2) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Tiefling",
    "cr": "1/8",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Hellish Resistance: Tieflings have resistance to fire damage.",
      "Innate Spellcasting: Ability is Charisma. At will: thaumaturgy."
    ],
    "actions": [
      "Dagger: Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 4 (1d4 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Transmuter Wizard",
    "cr": "5",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Transmuter's Stone: The wizard carries a magic stone it crafted. While carrying the stone, the wizard can benefit from one of the following: Darkvision (60ft), +10 speed, Proficiency in Con saves, or Resistance to one damage type (Acid, Cold, Fire, Lightning, Thunder)."
    ],
    "actions": [
      "Multiattack: The wizard makes three Arcane Burst attacks.",
      "Arcane Burst: Melee or Ranged Spell Attack: +6 to hit, reach 5 ft. or range 120 ft., one target. Hit: 19 (3d10 + 3) force damage.",
      "Spellcasting: The wizard casts one of the following spells (Save DC 14): At will: light, prestidigitation; 2/day each: fireball, slow, polymorph."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Treant",
    "cr": "9",
    "type": "Huge Plant",
    "alignment": "Chaotic Good",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "False Appearance: While the treant remains motionless, it is indistinguishable from a normal tree.",
      "Siege Monster: The treant deals double damage to objects and structures."
    ],
    "actions": [
      "Multiattack: The treant makes two slam attacks.",
      "Slam: Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 16 (3d6 + 6) bludgeoning damage.",
      "Rock: Ranged Weapon Attack: +10 to hit, range 60/180 ft., one target. Hit: 28 (4d10 + 6) bludgeoning damage.",
      "Animate Trees (1/Day): The treant magically animates one or two trees it can see within 60 feet of it. These trees have the same statistics as a treant, except they have Intelligence and Charisma scores of 1, they can't speak, and they have only the Slam action option."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Troglodyte",
    "cr": "1/4",
    "type": "Medium Humanoid (Troglodyte)",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Chameleon Skin: The troglodyte has advantage on Dexterity (Stealth) checks made to hide.",
      "Stench: Any creature other than a troglodyte that starts its turn within 5 feet of the troglodyte must succeed on a DC 12 Constitution saving throw or be poisoned until the start of its next turn.",
      "Sunlight Sensitivity: While in sunlight, the troglodyte has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Multiattack: The troglodyte makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage.",
      "Claw: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Troll",
    "cr": "5",
    "type": "Large Giant",
    "alignment": "Chaotic Evil",
    "biomes": ["Arctic", "Forest", "Hill", "Mountain", "Swamp", "Underdark"],
    "immunities": [],
    "traits": [
      "Keen Smell: The troll has advantage on Wisdom (Perception) checks that rely on smell.",
      "Regeneration: The troll regains 10 hit points at the start of its turn. If the troll takes acid or fire damage, this trait doesn't function at the start of the troll's next turn. The troll dies only if it starts its turn with 0 hit points and doesn't regenerate."
    ],
    "actions": [
      "Multiattack: The troll makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) piercing damage.",
      "Claw: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Umber Hulk",
    "cr": "5",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Confusing Gaze: When a creature starts its turn within 30 feet of the umber hulk and is able to see its eyes, the umber hulk can force it to make a DC 15 Wisdom saving throw. On a failure, the creature can't take reactions and must roll a d8 to determine its behavior until the start of its next turn.",
      "Tunneler: The umber hulk can burrow through solid rock at half its burrowing speed and leaves a 5-foot-wide, 8-foot-high tunnel in its wake."
    ],
    "actions": [
      "Multiattack: The umber hulk makes three attacks: two with its claws and one with its bite.",
      "Claw: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) slashing damage.",
      "Bite: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Unicorn",
    "cr": "5",
    "type": "Large Celestial",
    "alignment": "Lawful Good",
    "biomes": ["Forest"],
    "immunities": ["Poison damage", "Condition: Charmed, Paralyzed, Poisoned"],
    "traits": [
      "Magic Resistance: The unicorn has advantage on saving throws against spells and other magical effects.",
      "Magic Weapons: The unicorn's weapon attacks are magical."
    ],
    "actions": [
      "Multiattack: The unicorn makes two attacks: one with its hooves and one with its horn.",
      "Hooves: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage.",
      "Horn: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) piercing damage.",
      "Healing Touch (3/Day): The unicorn touches another creature with its horn. The target magically regains 11 (2d8 + 2) hit points. In addition, the touch removes all diseases and neutralizes all poisons afflicting the target.",
      "Teleport (1/Day): The unicorn magically teleports itself and up to three willing creatures it can see within 5 feet of it to a location the unicorn is familiar with up to 1 mile away."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Vampire",
    "cr": "13",
    "type": "Medium Undead (Shapechanger)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban", "Underdark"],
    "immunities": [],
    "traits": [
      "Shapechanger: The vampire can use its action to polymorph into a Tiny bat, a Medium cloud of mist, or back into its true form.",
      "Legendary Resistance (3/Day): If the vampire fails a saving throw, it can choose to succeed instead.",
      "Misty Escape: When it drops to 0 HP outside its resting place, it transforms into mist instead of falling unconscious.",
      "Regeneration: The vampire regains 20 HP at the start of its turn if it has at least 1 HP and isn't in sunlight or running water.",
      "Spider Climb: The vampire can climb difficult surfaces, including upside down on ceilings."
    ],
    "actions": [
      "Multiattack: The vampire makes two attacks, only one of which can be a bite.",
      "Unarmed Strike: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage plus 14 (4d6) necrotic damage. Instead of dealing damage, the vampire can grapple the target (escape DC 18).",
      "Bite: Melee Weapon Attack: +9 to hit, reach 5 ft., one willing, restrained, or grappled creature. Hit: 7 (1d6 + 4) piercing damage plus 10 (3d6) necrotic damage. The target's HP maximum is reduced by an amount equal to the necrotic damage taken.",
      "Charm: The vampire targets one humanoid it can see within 30 feet. The target must succeed on a DC 17 Wisdom saving throw or be charmed for 24 hours."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Vrock",
    "cr": "6",
    "type": "Large Fiend (Demon)",
    "alignment": "Chaotic Evil",
    "biomes": ["Abyss", "Underdark"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Magic Resistance: The vrock has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The vrock makes two attacks: one with its beak and one with its talons.",
      "Beak: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) piercing damage.",
      "Talons: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 14 (2d10 + 3) slashing damage.",
      "Spore Cloud (Recharge 6): A 15-foot-radius cloud of toxic spores extends out from the vrock. Each creature in that area must succeed on a DC 14 Constitution saving throw or become poisoned. While poisoned, the creature takes 5 (1d10) poison damage at the start of each of its turns.",
      "Stunning Screech (1/Day): The vrock emits a horrific screech. Each creature within 20 feet that can hear it must succeed on a DC 14 Constitution saving throw or be stunned until the end of the vrock's next turn."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "War Priest",
    "cr": "9",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Urban"],
    "immunities": [],
    "traits": [
      "Spellcasting: The priest is a 9th-level spellcaster. Ability is Wisdom (save DC 15, +7 to hit). \nSpells: 1st: cure wounds, guiding bolt; 2nd: lesser restoration, spiritual weapon; 3rd: dispel magic, spirit guardians; 4th: banishment, guardian of faith; 5th: flame strike."
    ],
    "actions": [
      "Multiattack: The priest makes two melee attacks.",
      "Maul: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage plus 10 (3d6) radiant damage.",
      "Holy Flare (Recharge 6): The priest emits a burst of holy light. Each creature within 30 feet must succeed on a DC 15 Constitution saving throw or take 21 (6d6) radiant damage and be blinded until the end of the priest's next turn."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Warforged Titan",
    "cr": "8",
    "type": "Huge Construct",
    "alignment": "Lawful Neutral",
    "biomes": ["Urban"],
    "immunities": ["Poison damage", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Poisoned"],
    "traits": [
      "Platforms: Up to two Medium or smaller creatures can ride on the titan’s shoulders.",
      "Siege Monster: The titan deals double damage to objects and structures."
    ],
    "actions": [
      "Multiattack: The titan makes two attacks: one with its cleaver and one with its hammer.",
      "Cleaver: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 19 (3d8 + 6) slashing damage. If the target is a creature, it must succeed on a DC 17 Strength saving throw or be knocked prone.",
      "Hammer: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage. If the target is a creature, it must succeed on a DC 17 Strength saving throw or be pushed up to 10 feet away."
    ],
    "source": "Eberron: Rising from the Last War"
  },
  {
    "name": "Water Elemental",
    "cr": "5",
    "type": "Large Elemental",
    "alignment": "Neutral",
    "biomes": ["Coastal", "Underwater"],
    "immunities": ["Poison damage", "Condition: Exhaustion, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Water Form: The elemental can move through a space as narrow as 1 inch wide without squeezing.",
      "Freeze: If the elemental takes cold damage, it partially freezes; its speed is reduced by 20 feet until the end of its next turn."
    ],
    "actions": [
      "Multiattack: The elemental makes two slam attacks.",
      "Slam: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.",
      "Whelm (Recharge 4–6): Each creature in the elemental's space must make a DC 15 Strength saving throw. On a failure, a target takes 13 (2d8 + 4) bludgeoning damage. If it is Large or smaller, it is also grappled. Until this grapple ends, the target is restrained and unable to breathe."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Wight",
    "cr": "3",
    "type": "Medium Undead",
    "alignment": "Neutral Evil",
    "biomes": ["Urban", "Underdark", "Arctic"],
    "immunities": ["Poison damage", "Condition: Exhaustion, Poisoned"],
    "traits": [
      "Sunlight Sensitivity: While in sunlight, the wight has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Multiattack: The wight makes two longsword attacks or two longbow attacks. It can use its Life Drain in place of one longsword attack.",
      "Life Drain: Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. Hit: 5 (1d6 + 2) necrotic damage. The target must succeed on a DC 13 Constitution saving throw or its hit point maximum is reduced by an amount equal to the damage taken. The target dies if this effect reduces its hit point maximum to 0.",
      "Longsword: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) slashing damage, or 7 (1d10 + 2) slashing damage if used with two hands.",
      "Longbow: Ranged Weapon Attack: +4 to hit, range 150/600 ft., one target. Hit: 6 (1d8 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Wraith",
    "cr": "5",
    "type": "Medium Undead",
    "alignment": "Neutral Evil",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Poison, Necrotic damage", "Condition: Charmed, Exhaustion, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Incorporeal Movement: The wraith can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.",
      "Sunlight Sensitivity: While in sunlight, the wraith has disadvantage on attack rolls and Wisdom (Perception) checks."
    ],
    "actions": [
      "Life Drain: Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. Hit: 21 (4d8 + 3) necrotic damage. The target must succeed on a DC 14 Constitution saving throw or its hit point maximum is reduced by an amount equal to the damage taken.",
      "Create Specter: The wraith targets a humanoid within 10 feet that has been dead no longer than 1 minute and died violently. The target's spirit rises as a specter under the wraith's control."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Wyvern",
    "cr": "6",
    "type": "Large Dragon",
    "alignment": "Unaligned",
    "biomes": ["Hill", "Mountain"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Multiattack: The wyvern makes two attacks: one with its bite and one with its stinger. While flying, it can use its claws in place of one other attack.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) piercing damage.",
      "Claws: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
      "Stinger: Melee Weapon Attack: +7 to hit, reach 10 ft., one creature. Hit: 11 (2d6 + 4) piercing damage. The target must make a DC 15 Constitution saving throw, taking 24 (7d6) poison damage on a failed save, or half on a success."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Yeti",
    "cr": "3",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Arctic", "Mountain"],
    "immunities": ["Cold damage"],
    "traits": [
      "Fear of Fire: If the yeti takes fire damage, it has disadvantage on attack rolls and ability checks until the end of its next turn.",
      "Keen Smell: The yeti has advantage on Wisdom (Perception) checks that rely on smell.",
      "Snow Camouflage: The yeti has advantage on Dexterity (Stealth) checks made to hide in snowy terrain."
    ],
    "actions": [
      "Multiattack: The yeti makes two claw attacks.",
      "Claw: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) slashing damage plus 3 (1d6) cold damage.",
      "Chilling Gaze: The yeti targets one creature it can see within 30 feet. If the target can see the yeti, the target must succeed on a DC 13 Constitution saving throw or take 10 (3d6) cold damage and be paralyzed for 1 minute."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Zombie",
    "cr": "1/4",
    "type": "Medium Undead",
    "alignment": "Neutral Evil",
    "biomes": ["Urban", "Underdark", "Swamp"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Undead Fortitude: If damage reduces the zombie to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the zombie drops to 1 hit point instead."
    ],
    "actions": [
      "Slam: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 4 (1d6 + 1) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Werewolf",
    "cr": "3",
    "type": "Medium Humanoid (Human, Shapechanger)",
    "alignment": "Chaotic Evil",
    "biomes": ["Forest"],
    "immunities": ["Bludgeoning, Piercing, and Slashing from Nonmagical attacks that aren't Silvered"],
    "traits": [
      "Shapechanger: The werewolf can use its action to polymorph into a wolf-humanoid hybrid or into a wolf, or back into its true form, which is humanoid.",
      "Keen Hearing and Smell: The werewolf has advantage on Wisdom (Perception) checks that rely on hearing or smell."
    ],
    "actions": [
      "Multiattack (Humanoid or Hybrid Form Only): The werewolf makes two attacks: one with its bite and one with its claws or spear.",
      "Bite (Wolf or Hybrid Form Only): Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) piercing damage. If the target is a humanoid, it must succeed on a DC 12 Constitution saving throw or be cursed with werewolf lycanthropy.",
      "Claws (Hybrid Form Only): Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (2d4 + 2) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Bearded Devil",
    "cr": "3",
    "type": "Medium Fiend (Devil)",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Fire, Poison damage", "Condition: Poisoned"],
    "traits": [
      "Devil's Sight: Magical darkness doesn't impede the devil's darkvision.",
      "Magic Resistance: The devil has advantage on saving throws against spells and other magical effects.",
      "Steadfast: The devil can't be frightened while it can see an allied creature within 30 feet of it."
    ],
    "actions": [
      "Multiattack: The devil makes two attacks: one with its beard and one with its glaive.",
      "Beard: Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (1d8 + 2) piercing damage, and the target must succeed on a DC 12 Constitution saving throw or be poisoned for 1 minute.",
      "Glaive: Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 8 (1d10 + 3) slashing damage. If the target is a creature other than an undead or a construct, it must succeed on a DC 12 Constitution saving throw or lose 5 (1d10) hit points at the start of each of its turns due to an infernal wound."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Marilith",
    "cr": "16",
    "type": "Large Fiend (Demon)",
    "alignment": "Chaotic Evil",
    "biomes": ["Abyss", "Underdark"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Reactive: The marilith can take one reaction on every turn in a combat.",
      "Magic Resistance: The marilith has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The marilith makes seven attacks: six with its longswords and one with its tail.",
      "Longsword: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
      "Tail: Melee Weapon Attack: +9 to hit, reach 10 ft., one creature. Hit: 15 (2d10 + 4) bludgeoning damage plus the target is grappled (escape DC 19).",
      "Teleport: The marilith magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Phoenix",
    "cr": "16",
    "type": "Gargantuan Elemental",
    "alignment": "Neutral",
    "biomes": ["Mountain", "Desert"],
    "immunities": ["Fire, Poison damage", "Condition: Charmed, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Fiery Death and Rebirth: When the phoenix dies, it explodes. Each creature within 60 feet must make a DC 20 Dexterity save, taking 22 (4d10) fire damage. The phoenix's body is destroyed, but it leaves behind an egg-shaped cinder that hatches in 1d6 days.",
      "Fire Form: The phoenix can move through a space as narrow as 1 inch wide without squeezing.",
      "Illumination: The phoenix sheds bright light in a 60-foot radius."
    ],
    "actions": [
      "Multiattack: The phoenix makes two attacks: one with its beak and one with its talons.",
      "Beak: Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 15 (2d6 + 8) fire damage.",
      "Talons: Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) fire damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Gynosphinx",
    "cr": "11",
    "type": "Large Monstrosity",
    "alignment": "Lawful Neutral",
    "biomes": ["Desert", "Urban"],
    "immunities": ["Psychic damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks"],
    "traits": [
      "Inscrutable: The sphinx is immune to any effect that would sense its emotions or read its thoughts.",
      "Magic Weapons: The sphinx's weapon attacks are magical.",
      "Spellcasting: The sphinx is a 9th-level spellcaster (DC 17). Spells include: detect magic, identify, dispel magic, and legend lore."
    ],
    "actions": [
      "Multiattack: The sphinx makes two claw attacks.",
      "Claw: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
      "Teleport (3/Day): The sphinx magically teleports up to 120 feet to an unoccupied space it can see."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Living Cloudkill",
    "cr": "7",
    "type": "Large Construct",
    "alignment": "Unaligned",
    "biomes": ["Urban", "Swamp"],
    "immunities": ["Poison damage", "Condition: Blinded, Charmed, Deafened, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Amorphous: The living spell can move through a space as narrow as 1 inch wide without squeezing.",
      "Magic Resistance: The living spell has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The living spell makes two Slam attacks.",
      "Slam: Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 14 (2d8 + 5) bludgeoning damage plus 22 (5d8) poison damage.",
      "Spell Mimicry (Recharge 5–6): The living spell creates a 20-foot-radius sphere of poisonous yellow-green fog. Each creature in the area must make a DC 16 Constitution saving throw, taking 22 (5d8) poison damage on a failed save."
    ],
    "source": "Eberron: Rising from the Last War"
  },
  {
    "name": "Young Red Dragon",
    "cr": "10",
    "type": "Large Dragon",
    "alignment": "Chaotic Evil",
    "biomes": ["Mountain", "Hill"],
    "immunities": ["Fire damage"],
    "traits": [],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 3 (1d6) fire damage.",
      "Claw: Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.",
      "Fire Breath (Recharge 5–6): The dragon exhales fire in a 30-foot cone. Each creature in that area must make a DC 17 Dexterity saving throw, taking 56 (16d6) fire damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Pit Fiend",
    "cr": "20",
    "type": "Large Fiend (Devil)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Fire, Poison damage", "Condition: Poisoned"],
    "traits": [
      "Fear Aura: Any creature that starts its turn within 20 feet of the pit fiend must make a DC 21 Wisdom saving throw or be frightened until the start of its next turn.",
      "Magic Resistance: The pit fiend has advantage on saving throws against spells and other magical effects.",
      "Innate Spellcasting: Ability is Charisma (DC 21). At will: detect magic, fireball; 3/day each: hold monster, wall of fire."
    ],
    "actions": [
      "Multiattack: The pit fiend makes four attacks: one with its bite, one with its claw, one with its mace, and one with its tail.",
      "Bite: Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 22 (4d6 + 8) piercing damage. The target must succeed on a DC 21 Constitution saving throw or be poisoned. While poisoned, the target can't regain hit points.",
      "Mace: Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) bludgeoning damage plus 21 (6d6) fire damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Githyanki Warrior",
    "cr": "3",
    "type": "Medium Humanoid (Gith)",
    "alignment": "Lawful Evil",
    "biomes": ["Astral Plane", "Urban"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Intelligence (DC 12). At will: mage hand; 3/day each: jump, misty step, nondetection (self only)."
    ],
    "actions": [
      "Multiattack: The githyanki makes two greatsword attacks.",
      "Greatsword: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage plus 7 (2d6) psychic damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Wererat",
    "cr": "1/4",
    "type": "Medium Humanoid (Human, Shapechanger)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Bludgeoning, Piercing, and Slashing from Nonmagical attacks that aren't Silvered"],
    "traits": [
      "Shapechanger: The wererat can use its action to polymorph into a rat-humanoid hybrid or into a giant rat, or back into its true form.",
      "Keen Smell: The wererat has advantage on Wisdom (Perception) checks that rely on smell."
    ],
    "actions": [
      "Multiattack (Humanoid or Hybrid Form Only): The wererat makes two attacks, only one of which can be a bite.",
      "Bite (Rat or Hybrid Form Only): Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage. If the target is a humanoid, it must succeed on a DC 11 Constitution saving throw or be cursed with wererat lycanthropy.",
      "Shortsword (Humanoid or Hybrid Form Only): Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Flying Sword",
    "cr": "1/4",
    "type": "Small Construct",
    "alignment": "Unaligned",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Poison, Psychic damage", "Condition: Blinded, Charmed, Deafened, Frightened, Paralyzed, Petrified, Poisoned"],
    "traits": [
      "Antimagic Susceptibility: The sword is incapacitated while in the area of an antimagic field.",
      "False Appearance: While the sword remains motionless and isn't flying, it is indistinguishable from a normal sword."
    ],
    "actions": [
      "Longsword: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 5 (1d8 + 1) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Githzerai Enlightened",
    "cr": "10",
    "type": "Medium Humanoid (Gith)",
    "alignment": "Lawful Neutral",
    "biomes": ["Astral Plane", "Urban"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Wisdom (DC 16). At will: mage hand; 3/day each: shield, detect thoughts, haste, see invisibility.",
      "Psychic Defense: While the githzerai is wearing no armor and wielding no shield, its AC includes its Wisdom modifier."
    ],
    "actions": [
      "Multiattack: The githzerai makes three unarmed strikes.",
      "Unarmed Strike: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) bludgeoning damage plus 18 (4d8) psychic damage. If the target is a creature, the githzerai can cause one additional effect (e.g., knocked prone or pushed)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Young Blue Dragon",
    "cr": "9",
    "type": "Large Dragon",
    "alignment": "Lawful Evil",
    "biomes": ["Desert"],
    "immunities": ["Lightning damage"],
    "traits": [],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 16 (2d10 + 5) piercing damage plus 5 (1d10) lightning damage.",
      "Lightning Breath (Recharge 5–6): The dragon exhales lightning in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 16 Dexterity saving throw, taking 55 (10d10) lightning damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Black Dragon Wyrmling",
    "cr": "2",
    "type": "Medium Dragon",
    "alignment": "Chaotic Evil",
    "biomes": ["Swamp"],
    "immunities": ["Acid damage"],
    "traits": [
      "Amphibious: The dragon can breathe air and water."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (1d10 + 2) piercing damage plus 2 (1d4) acid damage.",
      "Acid Breath (Recharge 5–6): The dragon exhales acid in a 15-foot line that is 5 feet wide. Each creature in that line must make a DC 11 Dexterity saving throw, taking 22 (5d8) acid damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ankylosaurus",
    "cr": "3",
    "type": "Huge Beast",
    "alignment": "Unaligned",
    "biomes": ["Forest", "Grassland"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Tail: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 18 (4d6 + 4) bludgeoning damage. If the target is a creature, it must succeed on a DC 14 Strength saving throw or be knocked prone."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Azer",
    "cr": "2",
    "type": "Medium Elemental",
    "alignment": "Lawful Neutral",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Fire, Poison damage", "Condition: Poisoned"],
    "traits": [
      "Heated Body: A creature that touches the azer or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage.",
      "Heated Weapons: When the azer hits with a metal melee weapon, it deals an extra 3 (1d6) fire damage (included in the attack).",
      "Illumination: The azer sheds bright light in a 10-foot radius and dim light for an additional 10 feet."
    ],
    "actions": [
      "Warhammer: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage, or 8 (1d10 + 3) bludgeoning damage if used with two hands, plus 3 (1d6) fire damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Behir",
    "cr": "11",
    "type": "Huge Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Lightning damage"],
    "traits": [],
    "actions": [
      "Multiattack: The behir makes two attacks: one with its bite and one to constrict.",
      "Bite: Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage.",
      "Constrict: Melee Weapon Attack: +10 to hit, reach 5 ft., one Large or smaller creature. Hit: 17 (2d10 + 6) bludgeoning damage plus 17 (2d10 + 6) slashing damage. The target is grappled (escape DC 16) and restrained.",
      "Lightning Breath (Recharge 5–6): The behir exhales a line of lightning that is 20 feet long and 5 feet wide. Each creature in that line must make a DC 16 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save.",
      "Swallow: The behir makes one bite attack against a Medium or smaller target it is grappling. If the attack hits, the target is swallowed."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Boggle",
    "cr": "1/8",
    "type": "Small Fey",
    "alignment": "Chaotic Neutral",
    "biomes": ["Underdark", "Urban"],
    "immunities": [],
    "traits": [
      "Boggle Oil: The boggle excretes either Slippery Oil (advantage on escaping grapples/squeezing) or Sticky Oil (advantage on climbing/grappling).",
      "Dimensional Tether: The boggle can reach through a rift in space to any point it can see within 30 feet.",
      "Fire Susceptibility: If the boggle takes fire damage, it has disadvantage on attack rolls and ability checks until the end of its next turn."
    ],
    "actions": [
      "Pummel: Melee Weapon Attack: +1 to hit, reach 5 ft., one target. Hit: 2 (1d6 - 1) bludgeoning damage.",
      "Oil Puddle: The boggle creates a 5-foot-square puddle of oil that lasts for 1 hour (functioning as the grease spell)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Bugbear",
    "cr": "1",
    "type": "Medium Humanoid (Goblinoid)",
    "alignment": "Chaotic Evil",
    "biomes": ["Forest", "Grassland", "Hill", "Mountain", "Underdark"],
    "immunities": [],
    "traits": [
      "Brute: A melee weapon deals one extra die of its damage when the bugbear hits with it (included in the attack).",
      "Surprise Attack: If the bugbear surprises a creature and hits it with an attack during the first round of combat, the target takes an extra 7 (2d6) damage from the attack."
    ],
    "actions": [
      "Morningstar: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 11 (2d8 + 2) piercing damage.",
      "Javelin: Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 9 (2d6 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Carrion Crawler",
    "cr": "2",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Keen Smell: The crawler has advantage on Wisdom (Perception) checks that rely on smell.",
      "Spider Climb: The crawler can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    ],
    "actions": [
      "Multiattack: The carrion crawler makes two attacks: one with its tentacles and one with its bite.",
      "Tentacles: Melee Weapon Attack: +8 to hit, reach 10 ft., one creature. Hit: 4 (1d4 + 2) poison damage, and the target must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. Until this poison ends, the target is paralyzed.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (2d4 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Choker",
    "cr": "1",
    "type": "Small Aberration",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Aberrant Armor: While the choker is wearing no armor and wielding no shield, its AC includes its Wisdom modifier.",
      "Spider Climb: The choker can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    ],
    "actions": [
      "Multiattack: The choker makes two tentacle attacks.",
      "Tentacle: Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 5 (1d4 + 3) bludgeoning damage plus 3 (1d6) piercing damage. If the target is a creature, it is grappled (escape DC 15)."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Death Knight",
    "cr": "17",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Poison damage", "Condition: Exhaustion, Frightened, Poisoned"],
    "traits": [
      "Magic Resistance: The death knight has advantage on saving throws against spells and other magical effects.",
      "Marshal Undead: Unless the death knight is incapacitated, it and any undead creatures of its choice within 60 feet of it have advantage on saving throws against features that turn undead.",
      "Spellcasting: The death knight is a 19th-level spellcaster. Ability is Charisma (DC 18). Spells include: command, searing smite, staggering smite, banishment, and destructive wave."
    ],
    "actions": [
      "Multiattack: The death knight makes three longsword attacks.",
      "Longsword: Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) slashing damage, or 10 (1d10 + 5) slashing damage if used with two hands, plus 18 (4d8) necrotic damage.",
      "Hellfire Orb (1/Day): The death knight hurls a magical ball of fire that explodes at a point it can see within 120 feet. Each creature in a 20-foot-radius sphere must make a DC 18 Dexterity saving throw, taking 35 (10d6) fire damage and 35 (10d6) necrotic damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Darkling",
    "cr": "1/2",
    "type": "Small Fey",
    "alignment": "Chaotic Neutral",
    "biomes": ["Underdark", "Urban"],
    "immunities": [],
    "traits": [
      "Death Flash: When the darkling dies, nonmagical light flashes out from it in a 10-foot radius. Each creature in that area must succeed on a DC 10 Constitution saving throw or be blinded until the end of its next turn.",
      "Light Sensitivity: While in bright light, the darkling has disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Dagger: Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage. If the darkling has advantage on the attack roll, the target takes an extra 7 (2d6) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Darkmantle",
    "cr": "1/2",
    "type": "Small Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Echolocation: The darkmantle can't use its blindsight while deafened.",
      "False Appearance: While the darkmantle remains motionless, it is indistinguishable from a cave formation, such as a stalactite."
    ],
    "actions": [
      "Crush: Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (1d6 + 3) bludgeoning damage, and the darkmantle attaches to the target's head. While attached, the target is blinded and unable to breathe, and the darkmantle has advantage on attack rolls against it.",
      "Darkness Aura (1/Day): A 15-foot radius of magical darkness extends from the darkmantle, moving with it and spreading around corners. The darkness lasts for 1 minute."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Death Dog",
    "cr": "1",
    "type": "Medium Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Desert", "Grassland", "Underdark"],
    "immunities": [],
    "traits": [
      "Two-Headed: The dog has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, or knocked unconscious."
    ],
    "actions": [
      "Multiattack: The dog makes two bite attacks.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage. If the target is a creature, it must succeed on a DC 12 Constitution saving throw or contract a disease. Until the disease is cured, the target can’t regain hit points."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Demilich",
    "cr": "18",
    "type": "Tiny Undead",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Necrotic, Poison, Psychic damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Charmed, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Avoidance: If the demilich is subjected to an effect that allows it to make a saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw.",
      "Legendary Resistance (3/Day): If the demilich fails a saving throw, it can choose to succeed instead.",
      "Turn Resistance: The demilich has advantage on saving throws against any effect that turns undead."
    ],
    "actions": [
      "Howl (Recharge 5–6): The demilich emits a bloodcurdling howl. Each creature within 30 feet that can hear the howl must succeed on a DC 15 Wisdom saving throw or drop to 0 hit points. On a success, a creature is frightened until the end of its next turn.",
      "Life Drain: The demilich targets up to three creatures it can see within 10 feet. Each target must succeed on a DC 19 Constitution saving throw or take 21 (6d6) necrotic damage.",
      "Energy Drain (Legendary Action): The demilich withers the life force of a creature within 30 feet. The target takes 21 (6d6) necrotic damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Displacer Beast",
    "cr": "3",
    "type": "Large Monstrosity",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Underdark"],
    "immunities": [],
    "traits": [
      "Avoidance: If the displacer beast is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds, and only half damage if it fails.",
      "Displacement: The displacer beast projects a magical illusion that makes it appear to be standing near its actual location, causing attack rolls against it to have disadvantage. This trait is disrupted if the beast takes damage."
    ],
    "actions": [
      "Multiattack: The displacer beast makes two attacks with its tentacles.",
      "Tentacle: Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage plus 3 (1d6) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Dolphin Delighter",
    "cr": "3",
    "type": "Medium Fey",
    "alignment": "Chaotic Good",
    "biomes": ["Coastal", "Underwater"],
    "immunities": [],
    "traits": [
      "Amphibious: The dolphin can breathe air and water.",
      "Dolphin Leap: If the dolphin moves at least 20 feet straight toward a creature and then hits it with a slam attack on the same turn, the target takes an extra 7 (2d6) bludgeoning damage."
    ],
    "actions": [
      "Multiattack: The dolphin makes two Slam attacks.",
      "Slam: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage.",
      "Dazzling Radiance (Recharge 5–6): The dolphin emits a burst of colorful light. Each creature within 15 feet of the dolphin must succeed on a DC 13 Wisdom saving throw or be blinded for 1 minute."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Doppelganger",
    "cr": "3",
    "type": "Medium Monstrosity (Shapechanger)",
    "alignment": "Neutral",
    "biomes": ["Urban"],
    "immunities": ["Condition: Charmed"],
    "traits": [
      "Shapechanger: The doppelganger can use its action to polymorph into a Small or Medium humanoid it has seen, or back into its true form.",
      "Ambusher: In the first round of a combat, the doppelganger has advantage on attack rolls against any creature it surprised.",
      "Surprise Attack: If the doppelganger surprises a creature and hits it with an attack during the first round of combat, the target takes an extra 10 (3d6) damage."
    ],
    "actions": [
      "Multiattack: The doppelganger makes two melee attacks.",
      "Slam: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage.",
      "Read Thoughts: The doppelganger magically reads the surface thoughts of one creature within 60 feet."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Dragon Turtle",
    "cr": "17",
    "type": "Gargantuan Monstrosity",
    "alignment": "Neutral",
    "biomes": ["Coastal", "Underwater"],
    "immunities": ["Fire damage"],
    "traits": [
      "Amphibious: The dragon turtle can breathe air and water."
    ],
    "actions": [
      "Multiattack: The dragon turtle makes three attacks: one with its bite and two with its claws. It can make one tail attack in place of its two claw attacks.",
      "Bite: Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 26 (3d12 + 7) piercing damage.",
      "Claw: Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 16 (2d8 + 7) slashing damage.",
      "Tail: Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 26 (3d12 + 7) bludgeoning damage. If the target is a creature, it must succeed on a DC 20 Strength saving throw or be pushed up to 10 feet away and knocked prone.",
      "Steam Breath (Recharge 5–6): The dragon turtle exhales scalding steam in a 60-foot cone. Each creature in that area must make a DC 18 Constitution saving throw, taking 52 (15d6) fire damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Dryad",
    "cr": "1",
    "type": "Medium Fey",
    "alignment": "Neutral",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "Speak with Beasts and Plants: The dryad can communicate with beasts and plants as if they shared a language.",
      "Tree Stride: Once on her turn, the dryad can use 10 feet of her movement to step magically into one living tree within her reach and emerge from a second living tree within 60 feet of the first tree.",
      "Innate Spellcasting: Ability is Charisma (DC 14). At will: druidcraft; 3/day each: entangle, goodberry; 1/day each: barkskin, pass without trace, shillelagh."
    ],
    "actions": [
      "Club: Melee Weapon Attack: +2 to hit (+6 to hit with shillelagh), reach 5 ft., one target. Hit: 2 (1d4) bludgeoning damage, or 8 (1d8 + 4) bludgeoning damage with shillelagh.",
      "Fey Charm: The dryad targets one humanoid or beast she can see within 30 feet. If the target can see her, it must succeed on a DC 14 Wisdom saving throw or be magically charmed for 1 day."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Darkling Elder",
    "cr": "2",
    "type": "Medium Fey",
    "alignment": "Chaotic Neutral",
    "biomes": ["Underdark", "Urban"],
    "immunities": [],
    "traits": [
      "Death Burn: When the darkling elder dies, magical light flashes out from it. Each creature within 10 feet of it must make a DC 11 Constitution saving throw, taking 7 (2d6) radiant damage on a failed save, or half as much damage on a successful one. If the saving throw fails by 5 or more, the creature is also blinded until the end of its next turn.",
      "Light Sensitivity: While in bright light, the darkling elder has disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight."
    ],
    "actions": [
      "Multiattack: The darkling elder makes two melee attacks.",
      "Shortsword: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage. If the elder has advantage on the attack roll, the target takes an extra 10 (3d6) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Elemental (Fire)",
    "cr": "5",
    "type": "Large Elemental",
    "alignment": "Neutral",
    "biomes": ["Desert", "Mountain"],
    "immunities": ["Fire, Poison damage", "Condition: Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Fire Form: The elemental can move through a space as narrow as 1 inch wide without squeezing. A creature that touches the elemental or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage.",
      "Illumination: The elemental sheds bright light in a 30-foot radius and dim light for an additional 30 feet.",
      "Water Susceptibility: For every 5 feet the elemental moves in water, or for every gallon of water splashed on it, it takes 1 cold damage."
    ],
    "actions": [
      "Multiattack: The elemental makes two slam attacks.",
      "Slam: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) fire damage. If the target is a creature or a flammable object, it ignites."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Empyrean",
    "cr": "23",
    "type": "Huge Celestial (Titan)",
    "alignment": "Chaotic Good (75%) or Neutral Evil (25%)",
    "biomes": ["Mountain", "Urban"],
    "immunities": ["Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Charmed, Frightened"],
    "traits": [
      "Innate Spellcasting: Ability is Charisma (DC 23). At will: greater restoration, pass without trace, water walking; 1/day each: commune, dispel evil and good, earthquake, fire storm, plane shift.",
      "Legendary Resistance (3/Day): If the empyrean fails a saving throw, it can choose to succeed instead.",
      "Magic Weapons: The empyrean's weapon attacks are magical."
    ],
    "actions": [
      "Maul: Melee Weapon Attack: +17 to hit, reach 10 ft., one target. Hit: 31 (6d6 + 10) bludgeoning damage. If the target is a creature, it must succeed on a DC 15 Constitution saving throw or be stunned until the end of the empyrean's next turn.",
      "Bolt: Ranged Spell Attack: +15 to hit, range 600 ft., one target. Hit: 24 (7d6) damage of one of the following types: acid, cold, fire, force, lightning, or thunder."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ettercap",
    "cr": "2",
    "type": "Medium Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "Spider Climb: The ettercap can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
      "Web Sense: While in contact with a web, the ettercap knows the exact location of any other creature in contact with the same web.",
      "Web Walker: The ettercap ignores movement restrictions caused by webbing."
    ],
    "actions": [
      "Multiattack: The ettercap makes two attacks: one with its bite and one with its claws.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) piercing damage plus 4 (1d8) poison damage. The target must succeed on a DC 11 Constitution saving throw or be poisoned for 1 minute.",
      "Claws: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (2d4 + 2) slashing damage.",
      "Web (Recharge 5–6): Ranged Weapon Attack: +4 to hit, range 30/60 ft., one Large or smaller creature. Hit: The creature is restrained by webbing."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Flameskull",
    "cr": "4",
    "type": "Tiny Undead",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark"],
    "immunities": ["Cold, Fire, Poison damage", "Condition: Charmed, Frightened, Paralyzed, Poisoned, Prone"],
    "traits": [
      "Illumination: The flameskull sheds bright light in a 15-foot radius and dim light for an additional 15 feet.",
      "Magic Resistance: The flameskull has advantage on saving throws against spells and other magical effects.",
      "Rejuvenation: If the flameskull is destroyed, it regains all its hit points in 1 hour unless holy water is sprinkled on its remains or a dispel magic or remove curse spell is cast on them.",
      "Spellcasting: Ability is Intelligence (DC 13). It has spells like magic missile, flaming sphere, and fireball."
    ],
    "actions": [
      "Multiattack: The flameskull uses Fire Ray twice.",
      "Fire Ray: Ranged Spell Attack: +5 to hit, range 30 ft., one target. Hit: 10 (3d6) fire damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Flumph",
    "cr": "1/8",
    "type": "Small Aberration",
    "alignment": "Lawful Good",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Advanced Telepathy: The flumph can perceive the content of any telepathic communication used within 60 feet of it.",
      "Prone Deficiency: If the flumph is knocked prone, it must succeed on a DC 10 Dexterity saving throw to right itself. Otherwise, it is incapacitated.",
      "Telepathic Shroud: The flumph is immune to any effect that would sense its emotions or read its thoughts, as well as all divination spells."
    ],
    "actions": [
      "Tendrils: Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. Hit: 4 (1d4 + 2) piercing damage plus 2 (1d4) acid damage. The target must succeed on a DC 10 Constitution saving throw or be poisoned for 1 minute.",
      "Stinking Spray (1/Day): Each creature in a 15-foot cone originating from the flumph must succeed on a DC 10 Dexterity saving throw or be coated in a foul-smelling liquid. A coated creature is poisoned."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Fomorian",
    "cr": "8",
    "type": "Huge Giant",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Multiattack: The fomorian makes two greatclub attacks.",
      "Greatclub: Melee Weapon Attack: +9 to hit, reach 15 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage.",
      "Evil Eye: The fomorian magically forces a creature it can see within 60 feet of it to make a DC 14 Charisma saving throw. On a failure, the creature takes 27 (6d8) psychic damage.",
      "Curse of the Evil Eye (Recharges after a Short or Long Rest): With a stare, the fomorian uses Evil Eye, but on a failed save, the creature is also cursed with physical deformity, reducing its speed by half and giving it disadvantage on ability checks and attacks."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Galeb Duhr",
    "cr": "6",
    "type": "Medium Elemental",
    "alignment": "Neutral",
    "biomes": ["Mountain"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "False Appearance: While the galeb duhr remains motionless, it is indistinguishable from a normal boulder.",
      "Rolling Charge: If the galeb duhr rolls at least 20 feet straight toward a target and then hits it with a slam attack on the same turn, the target takes an extra 7 (2d6) bludgeoning damage.",
      "Innate Spellcasting: Ability is Wisdom (DC 12). At will: detect magic, stone shape; 1/day each: move earth."
    ],
    "actions": [
      "Slam: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage.",
      "Animate Boulders (1/Day): The galeb duhr magically animates up to two boulders it can see within 60 feet. A boulder has the same statistics as a galeb duhr, except it has Intelligence and Charisma scores of 1 and can't speak."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Gargoyle",
    "cr": "2",
    "type": "Medium Elemental",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban", "Underdark", "Mountain"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "False Appearance: While the gargoyle remains motionless, it is indistinguishable from an inanimate statue."
    ],
    "actions": [
      "Multiattack: The gargoyle makes two attacks: one with its bite and one with its claws.",
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Claws: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ghast",
    "cr": "2",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban", "Underdark", "Swamp"],
    "immunities": ["Poison damage", "Condition: Charmed, Exhaustion, Poisoned"],
    "traits": [
      "Stench: Any creature that starts its turn within 5 feet of the ghast must succeed on a DC 10 Constitution saving throw or be poisoned until the start of its next turn.",
      "Turn Defiance: The ghast and any ghouls within 30 feet of it have advantage on saving throws against effects that turn undead."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) piercing damage.",
      "Claws: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage. If the target is a creature other than an undead, it must succeed on a DC 10 Constitution saving throw or be paralyzed for 1 minute."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ghoul",
    "cr": "1",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban", "Underdark", "Swamp"],
    "immunities": ["Poison damage", "Condition: Charmed, Exhaustion, Poisoned"],
    "traits": [],
    "actions": [
      "Bite: Melee Weapon Attack: +2 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) piercing damage.",
      "Claws: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (2d4 + 2) slashing damage. If the target is a creature other than an elf or undead, it must succeed on a DC 10 Constitution saving throw or be paralyzed for 1 minute."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Giant Strider",
    "cr": "1",
    "type": "Large Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark", "Mountain"],
    "immunities": ["Fire damage"],
    "traits": [
      "Fire Absorption: Whenever the giant strider is subjected to fire damage, it takes no damage and instead regains a number of hit points equal to the fire damage dealt."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) piercing damage.",
      "Fire Burst (Recharge 5-6): The giant strider hurls a gout of fire at a point it can see within 60 feet. Each creature in a 10-foot-radius sphere centered on that point must make a DC 12 Dexterity saving throw, taking 14 (4d6) fire damage on a failed save."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Hell Hound",
    "cr": "3",
    "type": "Medium Fiend",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark", "Urban"],
    "immunities": ["Fire damage"],
    "traits": [
      "Keen Hearing and Smell: The hound has advantage on Wisdom (Perception) checks that rely on hearing or smell.",
      "Pack Tactics: The hound has advantage on an attack roll against a creature if at least one of the hound's allies is within 5 feet of the creature and the ally isn't incapacitated."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage plus 7 (2d6) fire damage.",
      "Fire Breath (Recharge 5–6): The hound exhales fire in a 15-foot cone. Each creature in that area must make a DC 12 Dexterity saving throw, taking 21 (6d6) fire damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Helmed Horror",
    "cr": "4",
    "type": "Medium Construct",
    "alignment": "Neutral",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Force, Poison damage", "Condition: Blinded, Charmed, Deafened, Exhaustion, Frightened, Paralyzed, Petrified, Poisoned"],
    "traits": [
      "Magic Resistance: The horror has advantage on saving throws against spells and other magical effects.",
      "Spell Immunity: The horror is immune to three spells chosen by its creator (typically fireball, heat metal, and lightning bolt)."
    ],
    "actions": [
      "Multiattack: The horror makes two longsword attacks.",
      "Longsword: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) slashing damage, or 9 (1d10 + 4) slashing damage if used with two hands."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Intellect Devourer",
    "cr": "2",
    "type": "Tiny Aberration",
    "alignment": "Lawful Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Detect Sentience: The intellect devourer can sense the presence and location of any creature within 300 feet of it that has an Intelligence of 3 or higher, regardless of barriers."
    ],
    "actions": [
      "Multiattack: The intellect devourer makes one attack with its claws and uses Devour Intellect.",
      "Claws: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (2d4 + 2) slashing damage.",
      "Devour Intellect: The intellect devourer targets one creature it can see within 10 feet that has a brain. The target must succeed on a DC 12 Intelligence saving throw or take 11 (2d10) psychic damage. Also on a failure, roll 3d6: If the total equals or exceeds the target's Intelligence score, that score is reduced to 0.",
      "Body Thief: The intellect devourer initiates an Intelligence contest with an incapacitated humanoid within 5 feet of it. If it wins, the intellect devourer magically consumes the target's brain, teleports into the target's skull, and takes control of the body."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Invisible Stalker",
    "cr": "6",
    "type": "Medium Elemental",
    "alignment": "Neutral",
    "biomes": ["Urban", "Any"],
    "immunities": ["Poison damage", "Condition: Blown, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained, Unconscious"],
    "traits": [
      "Invisibility: The stalker is invisible.",
      "Faultless Tracker: The stalker is given a quarry by its summoner. The stalker knows the direction and distance to its quarry as long as the two of them are on the same plane of existence."
    ],
    "actions": [
      "Multiattack: The stalker makes two slam attacks.",
      "Slam: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Kuo-toa",
    "cr": "1/4",
    "type": "Medium Humanoid (Kuo-toa)",
    "alignment": "Neutral Evil",
    "biomes": ["Underdark", "Underwater"],
    "immunities": [],
    "traits": [
      "Amphibious: The kuo-toa can breathe air and water.",
      "Otherworldly Perception: The kuo-toa can sense the presence of any creature within 30 feet of it that is invisible or on the Ethereal Plane. It can pinpoint such a creature if it is moving.",
      "Slippery: The kuo-toa has advantage on ability checks and saving throws made to escape a grapple."
    ],
    "actions": [
      "Scepter: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 3 (1d4 + 1) bludgeoning damage plus 2 (1d4) lightning damage.",
      "Unarmed Strike: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 2 bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Lamia",
    "cr": "4",
    "type": "Large Monstrosity",
    "alignment": "Chaotic Evil",
    "biomes": ["Desert"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Charisma (DC 13). At will: disguise self, major image; 3/day each: charm person, mirror image, scrying, suggestion; 1/day each: geas."
    ],
    "actions": [
      "Multiattack: The lamia makes two attacks: one with its claws and one with its dagger or Intoxicating Touch.",
      "Claws: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 14 (2d10 + 3) slashing damage.",
      "Dagger: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4 + 3) piercing damage.",
      "Intoxicating Touch: Melee Spell Attack: +5 to hit, reach 5 ft., one creature. Hit: The target is magically cursed for 1 hour. While cursed, the target has disadvantage on Wisdom saving throws and ability checks."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Lich",
    "cr": "21",
    "type": "Medium Undead",
    "alignment": "Any Evil Alignment",
    "biomes": ["Urban", "Underdark"],
    "immunities": ["Poison damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Poisoned"],
    "traits": [
      "Legendary Resistance (3/Day): If the lich fails a saving throw, it can choose to succeed instead.",
      "Rejuvenation: If it has a phylactery, a destroyed lich gains a new body in 1d10 days, regaining all its hit points and becoming active again.",
      "Turn Resistance: The lich has advantage on saving throws against any effect that turns undead.",
      "Spellcasting: The lich is an 18th-level spellcaster (DC 20, +12 to hit). It has spells like Power Word Kill, Finger of Death, and Globe of Invulnerability."
    ],
    "actions": [
      "Paralyzing Touch: Melee Spell Attack: +12 to hit, reach 5 ft., one creature. Hit: 10 (3d6) cold damage. The target must succeed on a DC 18 Constitution saving throw or be paralyzed for 1 minute."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Stirge",
    "cr": "1/8",
    "type": "Tiny Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Forest", "Swamp", "Underdark"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Blood Drain: Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 5 (1d4 + 3) piercing damage, and the stirge attaches to the target. While attached, the stirge doesn't attack. Instead, at the start of each of the stirge's turns, the target loses 5 (1d4 + 3) hit points due to blood loss."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Tortle",
    "cr": "1/4",
    "type": "Medium Humanoid (Tortle)",
    "alignment": "Lawful Good",
    "biomes": ["Coastal"],
    "immunities": [],
    "traits": [
      "Hold Breath: The tortle can hold its breath for up to 1 hour.",
      "Natural Armor: Due to its shell and the shape of its body, the tortle has a base AC of 17."
    ],
    "actions": [
      "Claws: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) slashing damage.",
      "Shell Defense: The tortle withdraws into its shell. Until it emerges, it gains a +4 bonus to AC and has advantage on Strength and Constitution saving throws. While in its shell, it is prone, its speed is 0, and it has disadvantage on Dexterity saving throws."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Vargouille",
    "cr": "1",
    "type": "Tiny Fiend",
    "alignment": "Chaotic Evil",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage plus 10 (3d6) poison damage.",
      "Stunning Shriek: The vargouille shrieks. Each humanoid and beast within 30 feet of it that can hear it must succeed on a DC 12 Wisdom saving throw or be frightened until the end of the vargouille's next turn. While frightened in this way, a target is stunned.",
      "Abyssal Curse: The vargouille targets one stunned humanoid within 5 feet of it. The target must succeed on a DC 12 Charisma saving throw or become cursed. The cursed target's Charisma decreases by 1 every hour. When the score reaches 0, the target's head detaches and becomes a new vargouille."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Water Weird",
    "cr": "3",
    "type": "Large Elemental",
    "alignment": "Neutral",
    "biomes": ["Underwater"],
    "immunities": ["Poison damage", "Condition: Exhaustion, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Invisible in Water: The water weird is invisible while fully immersed in water.",
      "Water Bound: The water weird dies if it leaves the water to which it is bound or if that water is destroyed."
    ],
    "actions": [
      "Constrict: Melee Weapon Attack: +5 to hit, reach 10 ft., one creature. Hit: 13 (3d6 + 3) bludgeoning damage. If the target is Medium or smaller, it is grappled (escape DC 13) and pulled 5 feet toward the water weird. Until this grapple ends, the target is restrained and unable to breathe air."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Will-o'-Wisp",
    "cr": "2",
    "type": "Tiny Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Swamp"],
    "immunities": ["Lightning, Poison damage", "Condition: Exhaustion, Grappled, Paralyzed, Poisoned, Prone, Restrained, Unconscious"],
    "traits": [
      "Ephemeral: The will-o'-wisp can't wear or carry anything.",
      "Incorporeal Movement: The will-o'-wisp can move through other creatures and objects as if they were difficult terrain.",
      "Variable Illumination: The will-o'-wisp sheds bright light in a 5- to 20-foot radius and dim light for an additional number of feet equal to the chosen radius."
    ],
    "actions": [
      "Shock: Melee Spell Attack: +4 to hit, reach 5 ft., one creature. Hit: 9 (2d8) lightning damage.",
      "Invisibility: The will-o'-wisp magically turns invisible until it attacks or uses its Life Drain, or until its concentration ends.",
      "Consume Life: As a bonus action, the will-o'-wisp can target one creature it can see within 5 feet of it that has 0 hit points and is still alive. The target must succeed on a DC 10 Constitution saving throw or die. If the target dies, the will-o'-wisp regains 10 (3d6) hit points."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Wood Woad",
    "cr": "5",
    "type": "Medium Plant",
    "alignment": "Lawful Neutral",
    "biomes": ["Forest"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The wood woad has advantage on saving throws against spells and other magical effects.",
      "Regeneration: The wood woad regains 10 hit points at the start of its turn if it is in contact with the ground.",
      "Tree Stride: Once on its turn, the wood woad can use 10 feet of its movement to step magically into one living tree within its reach and emerge from a second living tree within 60 feet."
    ],
    "actions": [
      "Multiattack: The wood woad makes two club attacks.",
      "Club: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.",
      "Tree Warp (Recharge 5–6): The wood woad causes a tree within 30 feet of it to magically lash out. Each creature within 10 feet of that tree must make a DC 15 Dexterity saving throw, taking 18 (4d8) bludgeoning damage on a failure."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Xorn",
    "cr": "3",
    "type": "Medium Elemental",
    "alignment": "Neutral",
    "biomes": ["Mountain", "Underdark"],
    "immunities": [],
    "traits": [
      "Earth Glide: The xorn can burrow through nonmagical, unworked earth and stone without disturbing the material it moves through.",
      "Treasure Sense: The xorn can pinpoint, by scent, the location of precious metals and stones within 60 feet of it."
    ],
    "actions": [
      "Multiattack: The xorn makes three claw attacks and one bite attack.",
      "Claw: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 6 (1d4 + 4) slashing damage.",
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Yuan-ti Abomination",
    "cr": "7",
    "type": "Large Monstrosity (Yuan-ti)",
    "alignment": "Neutral Evil",
    "biomes": ["Desert", "Forest", "Swamp"],
    "immunities": ["Poison damage", "Condition: Poisoned"],
    "traits": [
      "Innate Spellcasting: Ability is Charisma (DC 15). At will: animal friendship (snakes only); 3/day each: suggestion; 1/day: fear.",
      "Magic Resistance: The yuan-ti has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The yuan-ti makes three attacks: one with its bite and two with its scimitar, or three with its longbow.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) piercing damage plus 10 (3d6) poison damage.",
      "Scimitar: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage.",
      "Constrict: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage and the target is grappled (escape DC 14)."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Zaratan",
    "cr": "22",
    "type": "Gargantuan Elemental",
    "alignment": "Neutral",
    "biomes": ["Coastal", "Mountain"],
    "immunities": ["Poison damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Charmed, Exhaustion, Frightened, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Earth-Shaking Movement: As a bonus action, the zaratan can stomp. Each creature on the ground within 20 feet must succeed on a DC 25 Strength saving throw or be knocked prone.",
      "Legendary Resistance (3/Day): If the zaratan fails a saving throw, it can choose to succeed instead.",
      "Siege Monster: The zaratan deals double damage to objects and structures."
    ],
    "actions": [
      "Multiattack: The zaratan makes two attacks: one with its bite and one with its stomp.",
      "Bite: Melee Weapon Attack: +17 to hit, reach 20 ft., one target. Hit: 28 (4d8 + 10) piercing damage.",
      "Stomp: Melee Weapon Attack: +17 to hit, reach 20 ft., one target. Hit: 26 (3d10 + 10) bludgeoning damage.",
      "Spew Debris (Recharge 5–6): The zaratan exhales a 60-foot cone of rocks and dirt. Each creature in that area must make a DC 25 Dexterity saving throw, taking 52 (15d6) bludgeoning damage on a failed save."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Zariel",
    "cr": "26",
    "type": "Medium Fiend (Devil)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban"],
    "immunities": ["Fire, Poison damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks that aren't Silvered", "Condition: Charmed, Exhaustion, Frightened, Poisoned"],
    "traits": [
      "Devil's Sight: Magical darkness doesn't impede Zariel's darkvision.",
      "Legendary Resistance (3/Day): If Zariel fails a saving throw, she can choose to succeed instead.",
      "Magic Resistance: Zariel has advantage on saving throws against spells and other magical effects.",
      "Regeneration: Zariel regains 20 hit points at the start of her turn."
    ],
    "actions": [
      "Multiattack: Zariel makes two attacks with her longsword or her flail.",
      "Longsword: Melee Weapon Attack: +16 to hit, reach 10 ft., one target. Hit: 17 (2d8 + 8) slashing damage plus 36 (8d8) fire damage.",
      "Flail: Melee Weapon Attack: +16 to hit, reach 10 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage plus 36 (8d8) fire damage. If the target is a creature, it must succeed on a DC 24 Strength saving throw or be knocked prone."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Aartuk Warrior",
    "cr": "2",
    "type": "Medium Plant",
    "alignment": "Star-spawned (Typically Lawful Evil)",
    "biomes": ["Space", "Asteroid"],
    "immunities": [],
    "traits": [
      "Spider Climb: The aartuk can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    ],
    "actions": [
      "Multiattack: The aartuk makes two Branch attacks or two Radiant Bolt attacks.",
      "Branch: Melee Weapon Attack: +4 to hit, reach 10 ft., one target. Hit: 5 (1d6 + 2) bludgeoning damage plus 3 (1d6) piercing damage.",
      "Radiant Bolt: Ranged Spell Attack: +4 to hit, range 60 ft., one target. Hit: 7 (2d6) radiant damage.",
      "Tongue: Melee Weapon Attack: +4 to hit, reach 15 ft., one target. Hit: The target is grappled (escape DC 12). If the target is a creature, it is pulled up to 10 feet toward the aartuk."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Aartuk Priest",
    "cr": "3",
    "type": "Medium Plant",
    "alignment": "Star-spawned (Typically Lawful Evil)",
    "biomes": ["Space", "Asteroid"],
    "immunities": [],
    "traits": [
      "Spider Climb: The aartuk can climb difficult surfaces, including upside down on ceilings.",
      "Innate Spellcasting: Ability is Wisdom (DC 13). At will: guidance, light; 3/day each: cure wounds, sanctuary; 1/day: lesser restoration."
    ],
    "actions": [
      "Multiattack: The aartuk makes two Branch attacks or two Radiant Bolt attacks.",
      "Branch: Melee Weapon Attack: +4 to hit, reach 10 ft., one target. Hit: 5 (1d6 + 2) bludgeoning damage plus 7 (2d6) radiant damage.",
      "Radiant Bolt: Ranged Spell Attack: +5 to hit, range 60 ft., one target. Hit: 10 (3d6) radiant damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Astral Elf Warrior",
    "cr": "3",
    "type": "Medium Humanoid (Elf)",
    "alignment": "Any Alignment (Typically Lawful Neutral)",
    "biomes": ["Astral Plane", "Space"],
    "immunities": [],
    "traits": [
      "Fey Ancestry: The elf has advantage on saving throws against being charmed, and magic can't put the elf to sleep.",
      "Astral Step (3/Day): As a bonus action, the elf can magically teleport up to 30 feet to an unoccupied space it can see."
    ],
    "actions": [
      "Multiattack: The elf makes two Spear attacks.",
      "Spear: Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 6 (1d6 + 3) piercing damage plus 7 (2d6) radiant damage.",
      "Luminous Bow: Ranged Weapon Attack: +5 to hit, range 150/600 ft., one target. Hit: 7 (1d8 + 3) radiant damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Astral Elf Star Priest",
    "cr": "5",
    "type": "Medium Humanoid (Elf)",
    "alignment": "Any Alignment (Typically Lawful Neutral)",
    "biomes": ["Astral Plane", "Space"],
    "immunities": [],
    "traits": [
      "Fey Ancestry: Advantage against charm; magic can't put it to sleep.",
      "Spellcasting: Ability is Wisdom (DC 14). Spells: At will: sacred flame, thaumaturgy; 2/day each: guiding bolt, mass healing word, revivify."
    ],
    "actions": [
      "Multiattack: The priest makes two Astral Flare attacks.",
      "Astral Flare: Melee or Ranged Spell Attack: +6 to hit, reach 5 ft. or range 60 ft., one target. Hit: 13 (2d8 + 4) radiant damage.",
      "Astral Step (3/Day): Bonus action teleport up to 30 feet."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Autognome",
    "cr": "1/2",
    "type": "Small Construct",
    "alignment": "Any Alignment",
    "biomes": ["Urban", "Space"],
    "immunities": ["Poison damage", "Condition: Paralyzed, Poisoned"],
    "traits": [
      "Armored Casing: The autognome has a base AC of 13 plus its Dexterity modifier.",
      "Heal Self (3/Day): As an action, the autognome can touch itself and expend a Hit Die to regain hit points (1d8 + 2)."
    ],
    "actions": [
      "Shock: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) lightning damage.",
      "Laser Bolt: Ranged Weapon Attack: +4 to hit, range 60/120 ft., one target. Hit: 5 (1d6 + 2) radiant damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Braxat",
    "cr": "9",
    "type": "Huge Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Desert", "Asteroid"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The braxat has advantage on saving throws against spells and other magical effects.",
      "Telepathy: 120 ft."
    ],
    "actions": [
      "Multiattack: The braxat makes two attacks: one with its bite and one with its spiked club.",
      "Bite: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 18 (3d8 + 5) piercing damage.",
      "Spiked Club: Melee Weapon Attack: +9 to hit, reach 15 ft., one target. Hit: 21 (3d10 + 5) bludgeoning damage plus 7 (2d6) piercing damage.",
      "Breath Weapon (Recharge 5–6): The braxat exhales a 60-foot cone of cold. Each creature in that area must make a DC 16 Constitution saving throw, taking 45 (10d8) cold damage on a failed save."
    ],
    "source": "Mordenkainen's Fiendish Folio / Spelljammer"
  },
  {
    "name": "B'rohg",
    "cr": "6",
    "type": "Huge Giant",
    "alignment": "Neutral",
    "biomes": ["Desert", "Asteroid"],
    "immunities": [],
    "traits": [
      "Four Arms: The b'rohg has four arms and can take two additional reactions per round, but only for the purpose of making opportunity attacks."
    ],
    "actions": [
      "Multiattack: The b'rohg makes four club attacks.",
      "Club: Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 14 (2d8 + 5) bludgeoning damage.",
      "Rock: Ranged Weapon Attack: +8 to hit, range 60/240 ft., one target. Hit: 21 (3d10 + 5) bludgeoning damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Chwinga Astronaut",
    "cr": "0",
    "type": "Tiny Elemental",
    "alignment": "Neutral",
    "biomes": ["Space"],
    "immunities": [],
    "traits": [
      "Evasion: If the chwinga is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds and half damage if it fails.",
      "Unusual Nature: The chwinga doesn't require air, food, or drink."
    ],
    "actions": [
      "Magical Gift (1/Day): The chwinga targets a humanoid within 5 feet. The target gains a supernatural charm of the DM's choice.",
      "Pass without Trace: The chwinga casts *pass without trace*, requiring no components."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Cosmic Horror",
    "cr": "18",
    "type": "Gargantuan Aberration",
    "alignment": "Chaotic Evil",
    "biomes": ["Space"],
    "immunities": ["Psychic damage", "Condition: Charmed, Frightened"],
    "traits": [
      "Legendary Resistance (3/Day): If the horror fails a saving throw, it can choose to succeed instead.",
      "Psychic Whispers: Any creature that starts its turn within 30 feet of the horror must succeed on a DC 19 Wisdom saving throw or take 10 (3d6) psychic damage."
    ],
    "actions": [
      "Multiattack: The horror makes three tentacle attacks.",
      "Tentacle: Melee Weapon Attack: +13 to hit, reach 30 ft., one target. Hit: 20 (3d8 + 7) bludgeoning damage plus 11 (2d10) psychic damage. If the target is a creature, it is grappled (escape DC 21).",
      "Psychic Beam (Recharge 5–6): The horror emits a beam of psychic energy in a 120-foot line. Each creature in that line must make a DC 19 Intelligence saving throw, taking 55 (10d10) psychic damage on a failure."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Dohwar",
    "cr": "1/8",
    "type": "Small Fey",
    "alignment": "Any Alignment (Typically Chaotic Good)",
    "biomes": ["Coastal", "Space"],
    "immunities": [],
    "traits": [
      "Hold Breath: The dohwar can hold its breath for 1 hour.",
      "Telepathic Bond: The dohwar can communicate telepathically with any creature it has touched within the last 24 hours."
    ],
    "actions": [
      "Beak: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Esthetic",
    "cr": "12",
    "type": "Gargantuan Aberration",
    "alignment": "Lawful Evil",
    "biomes": ["Space"],
    "immunities": ["Psychic damage"],
    "traits": [
      "Amorphous: The esthetic can move through a space as narrow as 1 inch wide without squeezing.",
      "Magic Resistance: The esthetic has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The esthetic makes two tentacle attacks. It can replace one attack with Acid Bile.",
      "Tentacle: Melee Weapon Attack: +10 to hit, reach 20 ft., one target. Hit: 18 (3d8 + 5) bludgeoning damage plus 11 (2d10) psychic damage. The target is grappled (escape DC 18).",
      "Acid Bile: Ranged Weapon Attack: +10 to hit, range 60 ft., one target. Hit: 22 (4d10) acid damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Eye Monger",
    "cr": "10",
    "type": "Large Aberration",
    "alignment": "Unaligned",
    "biomes": ["Asteroid", "Space"],
    "immunities": [],
    "traits": [
      "Antimagic Eye: The eye monger's open eye creates an area of antimagic, as in the *antimagic field* spell, in a 30-foot cone.",
      "False Appearance: While the eye monger remains motionless with its eye closed, it is indistinguishable from a small asteroid."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 22 (4d8 + 4) piercing damage. If the target is a Large or smaller creature, it is swallowed.",
      "Eye Ray: The eye monger shoots a ray of force from its eye. Ranged Spell Attack: +7 to hit, range 120 ft., one target. Hit: 27 (6d8) force damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Feyr",
    "cr": "4",
    "type": "Large Aberration",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban", "Space"],
    "immunities": ["Condition: Frightened"],
    "traits": [
      "Invisibility: The feyr can turn invisible as a bonus action.",
      "Sunlight Sensitivity: While in sunlight, the feyr has disadvantage on attack rolls and Wisdom (Perception) checks."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage plus 9 (2d8) psychic damage.",
      "Frightful Presence: Each creature within 60 feet must succeed on a DC 13 Wisdom saving throw or become frightened for 1 minute."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Gaj",
    "cr": "8",
    "type": "Large Aberration",
    "alignment": "Neutral Evil",
    "biomes": ["Desert", "Asteroid"],
    "immunities": ["Psychic damage"],
    "traits": [
      "Ambusher: In the first round of combat, the gaj has advantage on attack rolls against any creature it surprised."
    ],
    "actions": [
      "Multiattack: The gaj makes three attacks: one with its mandibles and two with its claws.",
      "Mandibles: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 16 (3d8 + 3) piercing damage plus 9 (2d8) psychic damage.",
      "Claw: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (2d4 + 5) slashing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Giff Shipmate",
    "cr": "3",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Space", "Urban"],
    "immunities": [],
    "traits": [
      "Firearms Knowledge: The giff's proficiency bonus is doubled for attack rolls made with firearms.",
      "Headfirst Charge: If the giff moves at least 20 feet straight toward a creature and then hits it with a Morningstar attack on the same turn, the target takes an extra 7 (2d6) piercing damage."
    ],
    "actions": [
      "Multiattack: The giff makes two Morningstar attacks or two Pistol attacks.",
      "Morningstar: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) piercing damage.",
      "Pistol: Ranged Weapon Attack: +6 to hit, range 30/90 ft., one target. Hit: 9 (1d10 + 4) piercing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Githyanki Buccaneer",
    "cr": "5",
    "type": "Medium Humanoid (Gith)",
    "alignment": "Any Alignment (Typically Lawful Evil)",
    "biomes": ["Astral Plane", "Space"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Intelligence (DC 13). At will: mage hand; 3/day each: jump, misty step; 1/day: see invisibility.",
      "Psychic Defense: While the githyanki is wearing no armor and wielding no shield, its AC includes its Wisdom modifier."
    ],
    "actions": [
      "Multiattack: The githyanki makes two Greatsword attacks.",
      "Greatsword: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage plus 10 (3d6) psychic damage.",
      "Astral Crossbow: Ranged Weapon Attack: +4 to hit, range 100/400 ft., one target. Hit: 6 (1d8 + 2) piercing damage plus 7 (2d6) psychic damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Hadozee Shipmate",
    "cr": "1/8",
    "type": "Medium Humanoid",
    "alignment": "Any Alignment",
    "biomes": ["Forest", "Space"],
    "immunities": [],
    "traits": [
      "Dextrous Feet: The hadozee can use its feet to manipulate objects as well as its hands.",
      "Glide: When the hadozee falls, it can use its reaction to spread its membranes and glide. It takes no falling damage and can move 5 feet horizontally for every 1 foot it falls."
    ],
    "actions": [
      "Shortsword: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Jammer Leech",
    "cr": "1/2",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Space", "Asteroid"],
    "immunities": [],
    "traits": [
      "False Appearance: While the leech remains motionless, it is indistinguishable from a patch of barnacles or fungal growth.",
      "Spelljammer Parasite: The leech can attach itself to the hull of a spelljamming ship. While attached, it slowly drains the ship's speed."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage plus 7 (2d6) acid damage. The target is grappled (escape DC 12)."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Kindori",
    "cr": "3",
    "type": "Gargantuan Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Space"],
    "immunities": [],
    "traits": [
      "Air Envelope: The kindori carries a pocket of fresh air around itself, allowing it and nearby creatures to breathe in space.",
      "Bioluminescence: The kindori sheds bright light in a 20-foot radius and dim light for an additional 20 feet."
    ],
    "actions": [
      "Ram: Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 17 (3d8 + 4) bludgeoning damage.",
      "Dazzling Light (Recharge 5–6): The kindori's spots flare with light. Each creature within 30 feet that can see the kindori must succeed on a DC 13 Constitution saving throw or be blinded for 1 minute."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Lunar Dragon Wyrmling",
    "cr": "2",
    "type": "Medium Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Space", "Mountain"],
    "immunities": ["Cold damage"],
    "traits": [
      "Unusual Nature: The dragon doesn't require air."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (1d10 + 2) piercing damage plus 2 (1d4) cold damage.",
      "Bewildering Breath (Recharge 5–6): The dragon exhales moonlight in a 15-foot cone. Each creature in that area must succeed on a DC 11 Wisdom saving throw or take 7 (2d6) radiant damage and be charmed until the end of its next turn."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Young Lunar Dragon",
    "cr": "8",
    "type": "Large Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Space", "Mountain"],
    "immunities": ["Cold damage"],
    "traits": [
      "Unusual Nature: Does not require air."
    ],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 15 (2d10 + 4) piercing damage plus 4 (1d8) cold damage.",
      "Claw: Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage.",
      "Bewildering Breath (Recharge 5–6): 30-foot cone. DC 14 Wisdom saving throw or take 31 (7d8) radiant damage and be charmed."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Adult Lunar Dragon",
    "cr": "13",
    "type": "Huge Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Space", "Mountain"],
    "immunities": ["Cold damage"],
    "traits": [
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead.",
      "Unusual Nature: The dragon doesn't require air."
    ],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 9 (2d8) cold damage.",
      "Claw: Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.",
      "Bewildering Breath (Recharge 5–6): The dragon exhales moonlight in a 60-foot cone. Each creature in that area must succeed on a DC 18 Wisdom saving throw or take 49 (11d8) radiant damage and be charmed until the end of its next turn."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Ancient Lunar Dragon",
    "cr": "20",
    "type": "Gargantuan Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Space", "Mountain"],
    "immunities": ["Cold damage"],
    "traits": [
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead.",
      "Unusual Nature: The dragon doesn't require air."
    ],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 13 (3d8) cold damage.",
      "Claw: Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) slashing damage.",
      "Bewildering Breath (Recharge 5–6): The dragon exhales moonlight in a 90-foot cone. Each creature in that area must succeed on a DC 21 Wisdom saving throw or take 67 (15d8) radiant damage and be charmed until the end of its next turn."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Megapede",
    "cr": "11",
    "type": "Gargantuan Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Desert", "Asteroid", "Space"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The megapede has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The megapede makes two attacks: one with its bite and one with its claws.",
      "Bite: Melee Weapon Attack: +10 to hit, reach 15 ft., one target. Hit: 19 (3d8 + 6) piercing damage plus 10 (3d6) poison damage. The target must succeed on a DC 17 Constitution saving throw or be poisoned for 1 minute.",
      "Claws: Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 16 (3d6 + 6) slashing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Mercane",
    "cr": "2",
    "type": "Large Celestial",
    "alignment": "Typically Lawful Neutral",
    "biomes": ["Urban", "Space"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Intelligence (DC 13). At will: detect magic, identify; 1/day each: dimension door, plane shift (self only)."
    ],
    "actions": [
      "Chakram: Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 30/60 ft., one target. Hit: 10 (2d6 + 3) slashing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Neh-thalggu (Brain Collector)",
    "cr": "4",
    "type": "Large Aberration",
    "alignment": "Chaotic Evil",
    "biomes": ["Space", "Underdark"],
    "immunities": [],
    "traits": [
      "Brain Collection: The neh-thalggu can store up to 12 brains. Each stored brain increases its spellcasting ability and grants it additional spells."
    ],
    "actions": [
      "Multiattack: The neh-thalggu makes one bite attack and two claw attacks.",
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) piercing damage plus 7 (2d6) poison damage.",
      "Claw: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Neogi Void Hunter",
    "cr": "4",
    "type": "Large Monstrosity",
    "alignment": "Lawful Evil",
    "biomes": ["Space"],
    "immunities": [],
    "traits": [
      "Spider Climb: The neogi can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    ],
    "actions": [
      "Multiattack: The neogi makes two bite attacks or two tentacle attacks.",
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage plus 7 (2d6) poison damage.",
      "Tentacle: Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 8 (1d10 + 3) bludgeoning damage and the target is grappled (escape DC 13)."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Plasmoid Explorer",
    "cr": "1/2",
    "type": "Medium Ooze",
    "alignment": "Any Alignment",
    "biomes": ["Space", "Urban"],
    "immunities": ["Condition: Grappled, Prone"],
    "traits": [
      "Amorphous: The plasmoid can move through a space as narrow as 1 inch wide without squeezing.",
      "Hold Breath: The plasmoid can hold its breath for 1 hour.",
      "Shape Self: As an action, the plasmoid can reshape its body to have a head and limbs, or become a limbless blob."
    ],
    "actions": [
      "Shortsword: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Shortbow: Ranged Weapon Attack: +4 to hit, range 80/320 ft., one target. Hit: 5 (1d6 + 2) piercing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Plasmoid Warrior",
    "cr": "2",
    "type": "Medium Ooze",
    "alignment": "Any Alignment",
    "biomes": ["Space", "Urban"],
    "immunities": ["Condition: Grappled, Prone"],
    "traits": [
      "Amorphous: The plasmoid can move through a space as narrow as 1 inch wide without squeezing.",
      "Hold Breath: The plasmoid can hold its breath for 1 hour."
    ],
    "actions": [
      "Multiattack: The plasmoid makes two Shortsword attacks.",
      "Shortsword: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage plus 3 (1d6) acid damage.",
      "Shortbow: Ranged Weapon Attack: +4 to hit, range 80/320 ft., one target. Hit: 5 (1d6 + 2) piercing damage plus 3 (1d6) acid damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Plasmoid Boss",
    "cr": "4",
    "type": "Medium Ooze",
    "alignment": "Any Alignment",
    "biomes": ["Space", "Urban"],
    "immunities": ["Condition: Grappled, Prone"],
    "traits": [
      "Amorphous: The plasmoid can move through a space as narrow as 1 inch wide without squeezing.",
      "Hold Breath: The plasmoid can hold its breath for 1 hour."
    ],
    "actions": [
      "Multiattack: The plasmoid makes three Shortsword attacks or three Shortbow attacks.",
      "Shortsword: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage plus 7 (2d6) acid damage.",
      "Shortbow: Ranged Weapon Attack: +5 to hit, range 80/320 ft., one target. Hit: 6 (1d6 + 3) piercing damage plus 7 (2d6) acid damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Psurlon Ringer",
    "cr": "1",
    "type": "Medium Aberration",
    "alignment": "Typically Lawful Evil",
    "biomes": ["Space", "Urban"],
    "immunities": ["Psychic damage"],
    "traits": [
      "Innate Spellcasting (Psionics): Ability is Charisma (DC 12). At will: mage hand; 3/day each: charm person, disguise self.",
      "Telepathic Bond: The psurlon can communicate telepathically with any other psurlon within 1 mile."
    ],
    "actions": [
      "Claws: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage.",
      "Psychic Bolt: Ranged Spell Attack: +4 to hit, range 60 ft., one target. Hit: 7 (2d4 + 2) psychic damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Psurlon",
    "cr": "2",
    "type": "Medium Aberration",
    "alignment": "Typically Lawful Evil",
    "biomes": ["Space", "Underdark"],
    "immunities": ["Psychic damage"],
    "traits": [
      "Innate Spellcasting (Psionics): Ability is Charisma (DC 13). At will: mage hand; 3/day each: charm person, suggestion; 1/day: confusion.",
      "Magic Resistance: The psurlon has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The psurlon makes two Claw attacks.",
      "Claws: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) slashing damage.",
      "Psychic Bolt: Ranged Spell Attack: +5 to hit, range 60 ft., one target. Hit: 10 (2d6 + 3) psychic damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Psurlon Leader",
    "cr": "4",
    "type": "Medium Aberration",
    "alignment": "Typically Lawful Evil",
    "biomes": ["Space", "Underdark"],
    "immunities": ["Psychic damage"],
    "traits": [
      "Innate Spellcasting (Psionics): Ability is Charisma (DC 14). At will: mage hand; 3/day each: charm person, suggestion, telekinesis; 1/day: dominate monster.",
      "Magic Resistance: The psurlon has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The psurlon makes two Claw attacks and one Psychic Bolt attack.",
      "Claws: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage.",
      "Psychic Bolt: Ranged Spell Attack: +6 to hit, range 60 ft., one target. Hit: 14 (3d6 + 4) psychic damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Reigar",
    "cr": "8",
    "type": "Medium Celestial",
    "alignment": "Typically Neutral",
    "biomes": ["Space", "Astral Plane"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Ability is Charisma (DC 16). At will: detect magic, light, minor illusion; 3/day each: hold person, invisibility, mirror image; 1/day each: dispel magic, polymorph.",
      "Summon Golem: As an action, the reigar can summon a helmed horror or stone golem it has created (usually present or nearby)."
    ],
    "actions": [
      "Multiattack: The reigar makes three Trident attacks or three Radiant Bolt attacks.",
      "Trident: Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 7 (1d6 + 4) piercing damage, or 8 (1d8 + 4) piercing damage if used with two hands, plus 10 (3d6) radiant damage.",
      "Radiant Bolt: Ranged Spell Attack: +8 to hit, range 120 ft., one target. Hit: 14 (3d6 + 4) radiant damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Gray Scavver",
    "cr": "1/4",
    "type": "Small Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Space", "Asteroid"],
    "immunities": [],
    "traits": [
      "Air Envelope: Carries a pocket of fresh air.",
      "Pack Tactics: Advantage on attack rolls if an ally is within 5 feet."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Void Scavver",
    "cr": "3",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Space"],
    "immunities": [],
    "traits": [
      "Air Envelope: Carries a pocket of fresh air.",
      "Shadow Stealth: While in dim light or darkness, it can take the Hide action as a bonus action."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) piercing damage. If the target is a creature, it must succeed on a DC 13 Constitution saving throw or take 7 (2d6) necrotic damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Solar Dragon Wyrmling",
    "cr": "3",
    "type": "Medium Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Space"],
    "immunities": ["Fire damage"],
    "traits": [
      "Unusual Nature: The dragon doesn't require air."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 8 (1d10 + 3) piercing damage plus 3 (1d6) fire damage.",
      "Luminous Breath (Recharge 5–6): The dragon exhales solar fire in a 15-foot cone. Each creature in that area must make a DC 13 Dexterity saving throw, taking 17 (5d6) fire damage on a failed save."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Young Solar Dragon",
    "cr": "9",
    "type": "Large Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Space"],
    "immunities": ["Fire damage"],
    "traits": [
      "Unusual Nature: Does not require air."
    ],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 16 (2d10 + 5) piercing damage plus 4 (1d8) fire damage.",
      "Claw: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage.",
      "Luminous Breath (Recharge 5–6): 30-foot cone. DC 16 Dexterity saving throw, taking 40 (9d8) fire damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Space Clown",
    "cr": "2",
    "type": "Medium Humanoid",
    "alignment": "Chaotic Evil",
    "biomes": ["Space", "Urban"],
    "immunities": [],
    "traits": [
      "Dying Gloat: When the clown dies, it releases a burst of magical flatulence. Each creature within 10 feet must succeed on a DC 12 Constitution saving throw or be poisoned for 1 minute."
    ],
    "actions": [
      "Multiattack: The clown makes two Scepter attacks or two Ray Gun attacks.",
      "Scepter: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) bludgeoning damage plus 3 (1d6) psychic damage.",
      "Ray Gun: Ranged Spell Attack: +4 to hit, range 60 ft., one target. Hit: 7 (2d6) psychic damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Space Hamster",
    "cr": "0",
    "type": "Tiny Beast",
    "alignment": "Unaligned",
    "biomes": ["Space", "Grassland"],
    "immunities": [],
    "traits": [
      "Fearless: The hamster is immune to the frightened condition."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 1 piercing damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Giant Space Hamster",
    "cr": "1/4",
    "type": "Large Beast",
    "alignment": "Unaligned",
    "biomes": ["Space", "Grassland"],
    "immunities": [],
    "traits": [
      "Trampling Charge: If the hamster moves at least 20 feet straight toward a creature and then hits it with a slam attack, the target must succeed on a DC 12 Strength saving throw or be knocked prone."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "Slam: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) bludgeoning damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Tarrasque",
    "cr": "30",
    "type": "Gargantuan Monstrosity (Titan)",
    "alignment": "Unaligned",
    "biomes": ["Any"],
    "immunities": ["Fire, Poison damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks", "Condition: Charmed, Frightened, Paralyzed, Poisoned"],
    "traits": [
      "Legendary Resistance (3/Day): If the tarrasque fails a saving throw, it can choose to succeed instead.",
      "Magic Resistance: The tarrasque has advantage on saving throws against spells and other magical effects.",
      "Reflective Carapace: Any time the tarrasque is targeted by a magic missile spell, a line spell, or a spell that requires a ranged attack roll, roll a d6. On a 1 to 5, the tarrasque is unaffected. On a 6, the tarrasque is unaffected, and the effect is reflected back at the caster."
    ],
    "actions": [
      "Multiattack: The tarrasque can use its Frightful Presence. It then makes five attacks: one with its bite, two with its claws, one with its horns, and one with its tail.",
      "Bite: Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 36 (4d12 + 10) piercing damage. If the target is a creature, it is grappled (escape DC 20).",
      "Swallow: The tarrasque makes one bite attack against a Large or smaller creature it is grappling. If the attack hits, the target is swallowed."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Vampire",
    "cr": "13",
    "type": "Medium Undead (Shapechanger)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban", "Underdark"],
    "immunities": [],
    "traits": [
      "Shapechanger: The vampire can use its action to polymorph into a Tiny bat, a Medium cloud of mist, or back into its true form.",
      "Regeneration: The vampire regains 20 HP at the start of its turn if it has at least 1 HP and isn't in sunlight or running water.",
      "Spider Climb: The vampire can climb difficult surfaces, including upside down on ceilings."
    ],
    "actions": [
      "Multiattack: The vampire makes two attacks, only one of which can be a bite.",
      "Unarmed Strike: Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage plus 14 (4d6) necrotic damage.",
      "Bite: Melee Weapon Attack: +9 to hit, reach 5 ft., one willing, restrained, or grappled creature. Hit: 7 (1d6 + 4) piercing damage plus 10 (3d6) necrotic damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ankylosaurus",
    "cr": "3",
    "type": "Huge Beast",
    "alignment": "Unaligned",
    "biomes": ["Forest", "Grassland"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Tail: Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 18 (4d6 + 4) bludgeoning damage. If the target is a creature, it must succeed on a DC 14 Strength saving throw or be knocked prone."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Azer",
    "cr": "2",
    "type": "Medium Elemental",
    "alignment": "Lawful Neutral",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Fire, Poison damage", "Condition: Poisoned"],
    "traits": [
      "Heated Body: A creature that touches the azer or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage.",
      "Heated Weapons: When the azer hits with a metal melee weapon, it deals an extra 3 (1d6) fire damage (included in the attack).",
      "Illumination: The azer sheds bright light in a 10-foot radius and dim light for an additional 10 feet."
    ],
    "actions": [
      "Warhammer: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage, or 8 (1d10 + 3) bludgeoning damage if used with two hands, plus 3 (1d6) fire damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Behir",
    "cr": "11",
    "type": "Huge Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Mountain", "Underdark"],
    "immunities": ["Lightning damage"],
    "traits": [],
    "actions": [
      "Multiattack: The behir makes two attacks: one with its bite and one to constrict.",
      "Bite: Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage.",
      "Constrict: Melee Weapon Attack: +10 to hit, reach 5 ft., one Large or smaller creature. Hit: 17 (2d10 + 6) bludgeoning damage plus 17 (2d10 + 6) slashing damage. The target is grappled (escape DC 16).",
      "Lightning Breath (Recharge 5–6): The behir exhales a line of lightning that is 20 feet long and 5 feet wide. Each creature in that line must make a DC 16 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Bugbear",
    "cr": "1",
    "type": "Medium Humanoid (Goblinoid)",
    "alignment": "Chaotic Evil",
    "biomes": ["Forest", "Grassland", "Mountain"],
    "immunities": [],
    "traits": [
      "Brute: A melee weapon deals one extra die of its damage when the bugbear hits with it.",
      "Surprise Attack: If the bugbear surprises a creature and hits it with an attack during the first round of combat, the target takes an extra 7 (2d6) damage."
    ],
    "actions": [
      "Morningstar: Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 11 (2d8 + 2) piercing damage.",
      "Javelin: Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 9 (2d6 + 2) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Adult Lunar Dragon",
    "cr": "13",
    "type": "Huge Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Space", "Mountain"],
    "immunities": ["Cold damage"],
    "traits": [
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead.",
      "Unusual Nature: The dragon doesn't require air."
    ],
    "actions": [
      "Multiattack: The dragon makes three attacks: one with its bite and two with its claws.",
      "Bite: Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 9 (2d8) cold damage.",
      "Bewildering Breath (Recharge 5–6): The dragon exhales moonlight in a 60-foot cone. DC 18 Wisdom saving throw or take 49 (11d8) radiant damage and be charmed."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Megapede",
    "cr": "11",
    "type": "Gargantuan Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Desert", "Asteroid", "Space"],
    "immunities": [],
    "traits": [
      "Magic Resistance: The megapede has advantage on saving throws against spells and other magical effects."
    ],
    "actions": [
      "Multiattack: The megapede makes two attacks: one with its bite and one with its claws.",
      "Bite: Melee Weapon Attack: +10 to hit, reach 15 ft., one target. Hit: 19 (3d8 + 6) piercing damage plus 10 (3d6) poison damage."
    ],
    "source": "Spelljammer: Adventures in Space"
  },
  {
    "name": "Zariel",
    "cr": "26",
    "type": "Medium Fiend (Devil)",
    "alignment": "Lawful Evil",
    "biomes": ["Urban"],
    "immunities": ["Fire, Poison damage", "Bludgeoning, Piercing, and Slashing from Nonmagical attacks that aren't Silvered", "Condition: Charmed, Exhaustion, Frightened, Poisoned"],
    "traits": [
      "Devil's Sight: Magical darkness doesn't impede Zariel's darkvision.",
      "Legendary Resistance (3/Day): If Zariel fails a saving throw, she can choose to succeed instead.",
      "Magic Resistance: Zariel has advantage on saving throws against spells."
    ],
    "actions": [
      "Multiattack: Zariel makes three attacks with her Longsword or her Javelins.",
      "Longsword: Melee Weapon Attack: +16 to hit, reach 5 ft., one target. Hit: 12 (1d8 + 8) slashing damage plus 36 (8d8) fire damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Ankheg",
    "cr": "2",
    "type": "Large Monstrosity",
    "alignment": "Unaligned",
    "biomes": ["Forest", "Grassland"],
    "immunities": [],
    "traits": [
      "Tunneler: The ankheg can burrow through solid rock at half its burrow speed and leaves a 5-foot-diameter tunnel in its wake."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage plus 3 (1d6) acid damage. If the target is a Large or smaller creature, it is grappled (escape DC 13).",
      "Acid Spray (Recharge 6): The ankheg spits acid in a line that is 30 feet long and 5 feet wide. Each creature in that line must make a DC 13 Dexterity saving throw, taking 10 (3d6) acid damage on a failed save."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Banderhobb",
    "cr": "5",
    "type": "Large Monstrosity",
    "alignment": "Neutral Evil",
    "biomes": ["Urban", "Forest", "Swamp"],
    "immunities": [],
    "traits": [
      "Resonant Connection: Knows distance and direction to a creature if it has a piece of them.",
      "Shadow Stealth: While in dim light or darkness, it can hide as a bonus action."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 22 (5d6 + 5) piercing damage and target is grappled.",
      "Tongue: Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 10 (3d6) necrotic damage.",
      "Shadow Jaunt: Teleports up to 30 feet to an unoccupied space in dim light or darkness."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Banshee",
    "cr": "4",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "biomes": ["Urban", "Forest"],
    "immunities": ["Cold, Necrotic, Poison", "Condition: Charmed, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained"],
    "traits": [
      "Detect Life: Magically senses non-undead/constructs within 5 miles.",
      "Incorporeal Movement: Moves through creatures/objects as difficult terrain."
    ],
    "actions": [
      "Corrupting Touch: Melee Spell Attack: +4 to hit, reach 5 ft. Hit: 12 (3d6 + 2) necrotic damage.",
      "Wail (1/Day): Non-undead/constructs within 30 feet must make a DC 13 Constitution save or drop to 0 HP."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Giff",
    "cr": "3",
    "type": "Medium Humanoid",
    "alignment": "Lawful Neutral",
    "biomes": ["Urban", "Astral Plane"],
    "immunities": [],
    "traits": [
      "Firearms Knowledge: Proficiency bonus is doubled for firearm attacks.",
      "Headbutt: Extra 7 (2d6) damage if moving 20+ feet before hitting."
    ],
    "actions": [
      "Multiattack: Makes two longsword or two musket attacks.",
      "Longsword: Melee Weapon Attack: +6 to hit. Hit: 8 (1d8 + 4) bludgeoning damage.",
      "Musket: Ranged Weapon Attack: +4 to hit. Hit: 7 (1d12 + 1) piercing damage.",
      "Frag Grenade (1/Day): 20-foot radius, DC 15 Dexterity save for 17 (5d6) piercing damage."
    ],
    "source": "Monsters of the Multiverse"
  },
  {
    "name": "Hill Giant",
    "cr": "5",
    "type": "Huge Giant",
    "alignment": "Chaotic Evil",
    "biomes": ["Hill"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Multiattack: Makes two greatclub attacks.",
      "Greatclub: Melee Weapon Attack: +8 to hit, reach 10 ft. Hit: 18 (3d8 + 5) bludgeoning damage.",
      "Rock: Ranged Weapon Attack: +8 to hit, range 60/240 ft. Hit: 21 (3d10 + 5) bludgeoning damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Oni",
    "cr": "7",
    "type": "Large Giant",
    "alignment": "Lawful Evil",
    "biomes": ["Forest", "Urban"],
    "immunities": [],
    "traits": [
      "Innate Spellcasting: Can cast Darkness, Invisibility, and Charm Person.",
      "Regeneration: Regains 10 HP at the start of its turn if it has at least 1 HP."
    ],
    "actions": [
      "Multiattack: Makes two claw or glaive attacks.",
      "Glaive: Melee Weapon Attack: +7 to hit, reach 10 ft. Hit: 15 (2d10 + 4) slashing damage.",
      "Change Shape: Polymorphs into a Small/Medium humanoid, Large giant, or back."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Otyugh",
    "cr": "5",
    "type": "Large Aberration",
    "alignment": "Neutral",
    "biomes": ["Underdark"],
    "immunities": [],
    "traits": [
      "Limited Telepathy: Transmits simple messages/images within 120 feet."
    ],
    "actions": [
      "Multiattack: Makes one bite and two tentacle attacks.",
      "Bite: Melee Weapon Attack: +6 to hit. Hit: 12 (2d8 + 3) piercing damage plus poison disease risk.",
      "Tentacle: Melee Weapon Attack: +6 to hit. Hit: 7 (1d8 + 3) bludgeoning damage and target is grappled."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Wyvern",
    "cr": "6",
    "type": "Large Dragon",
    "alignment": "Unaligned",
    "biomes": ["Hill", "Mountain"],
    "immunities": [],
    "traits": [],
    "actions": [
      "Multiattack: Makes two attacks: one with its bite and one with its stinger.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 10 ft. Hit: 11 (2d6 + 4) piercing damage.",
      "Stinger: Melee Weapon Attack: +7 to hit. Hit: 11 (2d6 + 4) piercing damage plus 24 (7d6) poison damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Xorn",
    "cr": "3",
    "type": "Medium Elemental",
    "alignment": "Neutral",
    "biomes": ["Underdark", "Mountain"],
    "immunities": [],
    "traits": [
      "Earth Glide: Can burrow through nonmagical unworked earth/stone without disturbing it.",
      "Treasure Sense: Pinpoints location of precious metals/stones within 60 feet."
    ],
    "actions": [
      "Multiattack: Makes three claw attacks and one bite attack.",
      "Claw: Melee Weapon Attack: +6 to hit. Hit: 6 (1d4 + 4) slashing damage.",
      "Bite: Melee Weapon Attack: +6 to hit. Hit: 13 (2d8 + 4) piercing damage."
    ],
    "source": "Monster Manual"
  },
  {
    "name": "Ancient Amethyst Dragon",
    "cr": "22",
    "type": "Gargantuan Dragon (Gem)",
    "alignment": "Typically Neutral",
    "biomes": ["Caves", "Secluded Pools", "Lakes"],
    "immunities": [],
    "resistances": ["Force", "Psychic"],
    "traits": [
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead.",
      "Telepathic Hub: The dragon can use its telepathy to initiate a conversation with up to eight creatures at once."
    ],
    "actions": [
      "Multiattack: Makes one Bite attack and two Claw attacks.",
      "Bite: Melee Weapon Attack: +15 to hit, reach 15 ft. Hit: 19 (2d10 + 8) piercing damage plus 13 (2d12) force damage.",
      "Claw: Melee Weapon Attack: +15 to hit, reach 10 ft. Hit: 15 (2d6 + 8) slashing damage.",
      "Singularity Breath (Recharge 5-6): Exhales a 90-foot cone of graviton energy. DC 23 Strength save or take 63 (14d8) force damage and be pulled toward the center."
    ],
    "source": "Fizban's Treasury of Dragons"
  },
  {
    "name": "Ancient Emerald Dragon",
    "cr": "21",
    "type": "Gargantuan Dragon (Gem)",
    "alignment": "Typically Lawful Neutral",
    "biomes": ["Subterranean", "Ancient Ruins"],
    "immunities": [],
    "resistances": ["Fire", "Psychic"],
    "traits": [
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead.",
      "Tunneler: Can burrow through solid rock and leave a 20-foot-diameter tunnel.",
      "Warp Perception (1/Day): Can cast mirage arcane without components."
    ],
    "actions": [
      "Multiattack: Makes one Bite attack and two Claw attacks.",
      "Bite: Melee Weapon Attack: +14 to hit, reach 15 ft. Hit: 18 (2d10 + 7) piercing damage plus 10 (3d6) psychic damage.",
      "Disorienting Breath (Recharge 5-6): Exhales psychic dissonance in a 90-foot cone. DC 22 Intelligence save or take 56 (16d6) psychic damage and suffer a 1d8 penalty to attacks/checks."
    ],
    "source": "Fizban's Treasury of Dragons"
  },
  {
    "name": "Ancient Moonstone Dragon",
    "cr": "21",
    "type": "Gargantuan Dragon",
    "alignment": "Typically Neutral",
    "biomes": ["Feywild", "Moonlit Peaks", "Forest Clearings"],
    "immunities": ["Charmed"],
    "traits": [
      "Legendary Resistance (3/Day): If the dragon fails a saving throw, it can choose to succeed instead."
    ],
    "actions": [
      "Multiattack: Makes one Bite attack and two Claw attacks.",
      "Bite: Melee Weapon Attack: +13 to hit, reach 15 ft. Hit: 17 (2d10 + 6) piercing damage plus 11 (2d10) radiant damage.",
      "Dream Breath (Recharge 5-6): Exhales mist in a 90-foot cone. DC 21 Constitution save or fall unconscious for 10 minutes.",
      "Moonlight Breath (Recharge 5-6): Exhales a 120-foot line of moonlight. DC 21 Dexterity save or take 60 (11d10) radiant damage."
    ],
    "source": "Fizban's Treasury of Dragons"
  },
  {
    "name": "Young Crystal Dragon",
    "cr": "5",
    "type": "Large Dragon (Gem)",
    "alignment": "Typically Chaotic Good",
    "biomes": ["Snowfields", "Mountain Peaks"],
    "immunities": [],
    "resistances": ["Radiant"],
    "traits": [
      "Regenerative Blue: While in sunlight, the dragon regains 5 hit points at the start of its turn."
    ],
    "actions": [
      "Multiattack: Makes one Bite attack and two Claw attacks.",
      "Bite: Melee Weapon Attack: +7 to hit, reach 10 ft. Hit: 9 (1d10 + 4) piercing damage plus 3 (1d6) radiant damage.",
      "Scintillating Breath (Recharge 5-6): Exhales a 30-foot cone of starlight. DC 14 Dexterity save or take 22 (4d10) radiant damage."
    ],
    "source": "Fizban's Treasury of Dragons"
  },
  {
    "name": "Topaz Dragon Wyrmling",
    "cr": "2",
    "type": "Medium Dragon (Gem)",
    "alignment": "Typically Chaotic Neutral",
    "biomes": ["Coastal Cliffs", "Beaches"],
    "immunities": [],
    "resistances": ["Necrotic"],
    "traits": [
      "Amphibious: Can breathe air and water."
    ],
    "actions": [
      "Bite: Melee Weapon Attack: +4 to hit, reach 5 ft. Hit: 7 (1d10 + 2) piercing damage plus 2 (1d4) necrotic damage.",
      "Desiccating Breath (Recharge 5-6): Exhales yellow energy in a 15-foot cone. DC 12 Constitution save or take 14 (4d6) necrotic damage."
    ],
    "source": "Fizban's Treasury of Dragons"
  }
]